{"stench":{"name":"stench","description":"The stench may cause the target to flinch.","effect_description":"This Pokémon's damaging moves have a 10% chance to make the target flinch with each hit if they do not already cause flinching as a secondary effect.  This ability does not stack with a held item.  Overworld: The wild encounter rate is halved while this Pokémon is first in the party.","short_effect_description":"Has a 10% chance of making target Pokémon flinch with each hit.","pokemon":["gloom","grimer","muk","stunky","skuntank","trubbish","garbodor","garbodor-gmax"]},"drizzle":{"name":"drizzle","description":"The Pokémon makes it rain when it enters a battle.","effect_description":"The weather changes to rain when this Pokémon enters battle and does not end unless replaced by another weather condition.  If multiple Pokémon with this ability, drought, sand stream, or snow warning are sent out at the same time, the abilities will activate in order of Speed, respecting trick room.  Each ability's weather will cancel the previous weather, and only the weather summoned by the slowest of the Pokémon will stay.","short_effect_description":"Summons rain that lasts indefinitely upon entering battle.","pokemon":["politoed","pelipper","kyogre"]},"speed-boost":{"name":"speed-boost","description":"Its Speed stat is gradually boosted.","effect_description":"This Pokémon's Speed rises one stage after each turn.","short_effect_description":"Raises Speed one stage after each turn.","pokemon":["yanma","torchic","combusken","blaziken","ninjask","carvanha","sharpedo","yanmega","venipede","whirlipede","scolipede","blaziken-mega"]},"battle-armor":{"name":"battle-armor","description":"Protects the Pokémon from critical hits.","effect_description":"Moves cannot score critical hits against this Pokémon.  This ability functions identically to shell armor.","short_effect_description":"Protects against critical hits.","pokemon":["cubone","marowak","kabuto","kabutops","anorith","armaldo","skorupi","drapion","type-null","perrserker","falinks"]},"sturdy":{"name":"sturdy","description":"It cannot be knocked out with one hit.","effect_description":"When this Pokémon is at full HP, any hit that would knock it out will instead leave it with 1 HP.  Regardless of its current HP, it is also immune to the one-hit KO moves: fissure, guillotine, horn drill, and sheer cold.  If this Pokémon is holding a focus sash, this ability takes precedence and the item will not be consumed.","short_effect_description":"Prevents being KOed from full HP, leaving 1 HP instead.  Protects against the one-hit KO moves regardless of HP.","pokemon":["geodude","graveler","golem","magnemite","magneton","onix","sudowoodo","pineco","forretress","steelix","shuckle","skarmory","donphan","nosepass","aron","lairon","aggron","relicanth","regirock","shieldon","bastiodon","bonsly","magnezone","probopass","roggenrola","boldore","gigalith","sawk","dwebble","crustle","tirtouga","carracosta","tyrunt","carbink","bergmite","avalugg","togedemaru","cosmoem","geodude-alola","graveler-alola","golem-alola","togedemaru-totem"]},"damp":{"name":"damp","description":"Prevents the use of self-destructing moves.","effect_description":"While this Pokémon is in battle, self destruct and explosion will fail and aftermath will not take effect.","short_effect_description":"Prevents self destruct, explosion, and aftermath from working while the Pokémon is in battle.","pokemon":["paras","parasect","psyduck","golduck","poliwag","poliwhirl","poliwrath","horsea","seadra","politoed","wooper","quagsire","kingdra","mudkip","marshtomp","swampert","frillish","jellicent"]},"limber":{"name":"limber","description":"Protects the Pokémon from paralysis.","effect_description":"This Pokémon cannot be paralyzed.  If a Pokémon is paralyzed and acquires this ability, its paralysis is healed; this includes when regaining a lost ability upon leaving battle.","short_effect_description":"Prevents paralysis.","pokemon":["persian","hitmonlee","ditto","buneary","lopunny","glameow","purrloin","liepard","stunfisk","hawlucha","mareanie","toxapex","clobbopus","grapploct"]},"sand-veil":{"name":"sand-veil","description":"Boosts the Pokémon’s evasion in a sandstorm.","effect_description":"During a sandstorm, this Pokémon has 1.25× its evasion, and it does not take sandstorm damage regardless of type.  The evasion bonus does not count as a stat modifier.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is halved in a sandstorm.","short_effect_description":"Increases evasion to 1.25× during a sandstorm.  Protects against sandstorm damage.","pokemon":["sandshrew","sandslash","diglett","dugtrio","geodude","graveler","golem","gligar","phanpy","donphan","larvitar","cacnea","cacturne","gible","gabite","garchomp","gliscor","stunfisk","helioptile","heliolisk","sandygast","palossand","silicobra","sandaconda","diglett-alola","dugtrio-alola","sandaconda-gmax"]},"static":{"name":"static","description":"Contact with the Pokémon may cause paralysis.","effect_description":"Whenever a move makes contact with this Pokémon, the move's user has a 30% chance of being paralyzed.  Pokémon that are immune to electric-type moves can still be paralyzed by this ability.  Overworld: If the lead Pokémon has this ability, there is a 50% chance that encounters will be with an electric Pokémon, if applicable.","short_effect_description":"Has a 30% chance of paralyzing attacking Pokémon on contact.","pokemon":["pikachu","raichu","voltorb","electrode","electabuzz","zapdos","pichu","mareep","flaaffy","ampharos","elekid","electrike","manectric","emolga","stunfisk","toxel","arctozolt","pikachu-rock-star","pikachu-belle","pikachu-pop-star","pikachu-phd","pikachu-libre","pikachu-cosplay","pikachu-original-cap","pikachu-hoenn-cap","pikachu-sinnoh-cap","pikachu-unova-cap","pikachu-kalos-cap","pikachu-alola-cap","pikachu-partner-cap","pikachu-gmax"]},"volt-absorb":{"name":"volt-absorb","description":"Restores HP if hit by an Electric-type move.","effect_description":"Whenever an electric-type move hits this Pokémon, it heals for 1/4 of its maximum HP, negating any other effect on it.  This ability will not take effect if this Pokémon is ground-type and thus immune to Electric moves.  Electric moves will ignore this Pokémon's substitute.  This effect includes non-damaging moves, i.e. thunder wave.","short_effect_description":"Absorbs electric moves, healing for 1/4 max HP.","pokemon":["jolteon","chinchou","lanturn","minun","pachirisu","zeraora","dracozolt","arctozolt","thundurus-therian"]},"water-absorb":{"name":"water-absorb","description":"Restores HP if hit by a Water-type move.","effect_description":"Whenever a water-type move hits this Pokémon, it heals for 1/4 of its maximum HP, negating any other effect on it.  Water moves will ignore this Pokémon's substitute.","short_effect_description":"Absorbs water moves, healing for 1/4 max HP.","pokemon":["poliwag","poliwhirl","poliwrath","lapras","vaporeon","chinchou","lanturn","politoed","wooper","quagsire","mantine","cacnea","cacturne","mantyke","tympole","palpitoad","seismitoad","maractus","frillish","jellicent","volcanion","dewpider","araquanid","dracovish","arctovish","araquanid-totem","lapras-gmax"]},"oblivious":{"name":"oblivious","description":"Keeps the Pokémon from being infatuated or falling for taunts.","effect_description":"This Pokémon cannot be infatuated and is immune to captivate.  If a Pokémon is infatuated and acquires this ability, its infatuation is cleared.","short_effect_description":"Prevents infatuation and protects against captivate.","pokemon":["slowpoke","slowbro","lickitung","jynx","slowking","swinub","piloswine","smoochum","illumise","wailmer","wailord","numel","barboach","whiscash","feebas","spheal","sealeo","walrein","lickilicky","mamoswine","salandit","salazzle","bounsweet","steenee","salazzle-totem"]},"cloud-nine":{"name":"cloud-nine","description":"Eliminates the effects of weather.","effect_description":"While this Pokémon is in battle, weather can still be in play, but will not have any of its effects.  This ability functions identically to air lock.","short_effect_description":"Negates all effects of weather, but does not prevent the weather itself.","pokemon":["psyduck","golduck","lickitung","swablu","altaria","lickilicky","drampa"]},"compound-eyes":{"name":"compound-eyes","description":"Boosts the Pokémon’s accuracy.","effect_description":"This Pokémon's moves have 1.3× their accuracy.  This ability has no effect on the one-hit KO moves (fissure, guillotine, horn drill, and sheer cold).  Overworld: If the first Pokémon in the party has this ability, the chance of a wild Pokémon holding a particular item is raised from 50%, 5%, or 1% to 60%, 20%, or 5%, respectively.","short_effect_description":"Increases moves' accuracy to 1.3×.","pokemon":["butterfree","venonat","yanma","dustox","nincada","joltik","galvantula","scatterbug","vivillon","blipbug","dottler","butterfree-gmax"]},"insomnia":{"name":"insomnia","description":"Prevents the Pokémon from falling asleep.","effect_description":"This Pokémon cannot be asleep.  This causes rest to fail altogether.  If a Pokémon is asleep and acquires this ability, it will immediately wake up; this includes when regaining a lost ability upon leaving battle.  This ability functions identically to vital spirit in battle.","short_effect_description":"Prevents sleep.","pokemon":["drowzee","hypno","hoothoot","noctowl","spinarak","ariados","murkrow","delibird","shuppet","banette","honchkrow","pumpkaboo-average","gourgeist-average","pumpkaboo-small","pumpkaboo-large","pumpkaboo-super","gourgeist-small","gourgeist-large","gourgeist-super","mewtwo-mega-y"]},"color-change":{"name":"color-change","description":"The Pokémon’s type becomes the type of the move used on it.","effect_description":"Whenever this Pokémon takes damage from a move, the Pokémon's type changes to match the move.  If the Pokémon has two types, both are overridden.  The Pokémon must directly take damage; for example, moves blocked by a substitute will not trigger this ability, nor will moves that deal damage indirectly, such as spikes.  This ability takes effect on only the last hit of a multiple-hit attack.  In Pokémon Colosseum and XD: Gale of Darkness, this ability does not take effect on Shadow-type moves.","short_effect_description":"Changes type to match when hit by a damaging move.","pokemon":["kecleon"]},"immunity":{"name":"immunity","description":"Prevents the Pokémon from getting poisoned.","effect_description":"This Pokémon cannot be poisoned.  This includes bad poison.  If a Pokémon is poisoned and acquires this ability, its poison is healed; this includes when regaining a lost ability upon leaving battle.","short_effect_description":"Prevents poison.","pokemon":["snorlax","gligar","zangoose","snorlax-gmax"]},"flash-fire":{"name":"flash-fire","description":"Powers up the Pokémon’s Fire- type moves if it’s hit by one.","effect_description":"This Pokémon is immune to fire-type moves.  Once this Pokémon has been hit by a Fire move, its own Fire moves will inflict 1.5× as much damage until it leaves battle.  This ability has no effect while the Pokémon is frozen.  The Fire damage bonus is retained even if the Pokémon is frozen and thawed or the ability is lost or disabled.  Fire moves will ignore this Pokémon's substitute.  This ability takes effect even on non-damaging moves, i.e. will o wisp.","short_effect_description":"Protects against fire moves.  Once one has been blocked, the Pokémon's own Fire moves inflict 1.5× damage until it leaves battle.","pokemon":["vulpix","ninetales","growlithe","arcanine","ponyta","rapidash","flareon","cyndaquil","quilava","typhlosion","houndour","houndoom","heatran","litwick","lampent","chandelure","heatmor","rolycoly","carkol","coalossal","sizzlipede","centiskorch","coalossal-gmax","centiskorch-gmax"]},"shield-dust":{"name":"shield-dust","description":"Blocks the additional effects of attacks taken.","effect_description":"This Pokémon is immune to the extra effects of moves used against it.  An extra effect is a move's chance, listed as an \"effect chance\", to inflict a status ailment, cause a stat change, or make the target flinch in addition to the move's main effect.  For example, thunder shock's paralysis is an extra effect, but thunder wave's is not, nor are knock off's item removal and air cutter's increased critical hit rate.","short_effect_description":"Protects against incoming moves' extra effects.","pokemon":["caterpie","weedle","venomoth","wurmple","dustox","scatterbug","vivillon","cutiefly","ribombee","snom","frosmoth","ribombee-totem"]},"own-tempo":{"name":"own-tempo","description":"Prevents the Pokémon from becoming confused.","effect_description":"This Pokémon cannot be confused.  If a Pokémon is confused and acquires this ability, its confusion will immediately be healed.","short_effect_description":"Prevents confusion.","pokemon":["slowpoke","slowbro","lickitung","slowking","smeargle","lotad","lombre","ludicolo","numel","spoink","grumpig","spinda","glameow","purugly","lickilicky","petilil","lilligant","espurr","bergmite","avalugg","mudbray","mudsdale","rockruff-own-tempo","slowpoke-galar","slowbro-galar","slowking-galar","indeedee-female"]},"suction-cups":{"name":"suction-cups","description":"Negates all moves and items that force switching out.","effect_description":"This Pokémon cannot be forced out of battle by moves such as whirlwind.  dragon tail and circle throw still inflict damage against this Pokémon.  Overworld: If the lead Pokémon has this ability, the success rate while fishing is increased.","short_effect_description":"Prevents being forced out of battle by other Pokémon's moves.","pokemon":["octillery","lileep","cradily","inkay","malamar"]},"intimidate":{"name":"intimidate","description":"Lowers the opposing Pokémon’s Attack stat.","effect_description":"When this Pokémon enters battle, the opponent's Attack is lowered by one stage.  In a double battle, both opponents are affected.  This ability also takes effect when acquired during a battle, but will not take effect again if lost and reobtained without leaving battle.  This ability has no effect on an opponent that has a substitute.  Overworld: If the first Pokémon in the party has this ability, any random encounter with a Pokémon five or more levels lower than it has a 50% chance of being skipped.","short_effect_description":"Lowers opponents' Attack one stage upon entering battle.","pokemon":["ekans","arbok","growlithe","arcanine","tauros","gyarados","snubbull","granbull","qwilfish","stantler","hitmontop","mightyena","masquerain","mawile","salamence","staravia","staraptor","shinx","luxio","luxray","herdier","stoutland","sandile","krokorok","krookodile","scraggy","scrafty","litten","torracat","incineroar","landorus-therian","manectric-mega"]},"shadow-tag":{"name":"shadow-tag","description":"Prevents opposing Pokémon from escaping.","effect_description":"While this Pokémon is in battle, opposing Pokémon cannot flee or switch out.  Other Pokémon with this ability are unaffected.  Pokémon with run away can still flee.  Pokémon can still switch out with the use of a move or item.","short_effect_description":"Prevents opponents from fleeing or switching out.","pokemon":["wobbuffet","wynaut","gothita","gothorita","gothitelle","gengar-mega"]},"rough-skin":{"name":"rough-skin","description":"Inflicts damage to the attacker on contact.","effect_description":"Whenever a move makes contact with this Pokémon, the move's user takes 1/8 of its maximum HP in damage.  This ability functions identically to iron barbs.","short_effect_description":"Damages attacking Pokémon for 1/8 their max HP on contact.","pokemon":["carvanha","sharpedo","gible","gabite","garchomp","druddigon"]},"wonder-guard":{"name":"wonder-guard","description":"Only supereffective moves will hit.","effect_description":"This Pokémon is immune to damaging moves that are not super effective against it.  Moves that inflict fixed damage, such as night shade or seismic toss, are considered super effective if their types are.  Damage not directly dealt by moves, such as damage from weather, a status ailment, or spikes, is not prevented.  This ability cannot be copied with role play or traded away with skill swap, but it can be copied with trace, disabled with gastro acid, or changed with worry seed.  This Pokémon can still use Role Play itself to lose this ability, but not Skill Swap.  If this Pokémon has a substitute, this ability will block moves as usual and any moves not blocked will react to the Substitute as usual.","short_effect_description":"Protects against damaging moves that are not super effective.","pokemon":["shedinja"]},"levitate":{"name":"levitate","description":"Gives full immunity to all Ground-type moves.","effect_description":"This Pokémon is immune to ground-type moves, spikes, toxic spikes, and arena trap.  This ability is disabled during gravity or ingrain, or while holding an iron ball.  This ability is not disabled during roost.","short_effect_description":"Evades ground moves.","pokemon":["gastly","haunter","koffing","weezing","misdreavus","unown","vibrava","flygon","lunatone","solrock","baltoy","claydol","duskull","chimecho","latias","latios","mismagius","chingling","bronzor","bronzong","carnivine","rotom","uxie","mesprit","azelf","cresselia","tynamo","eelektrik","eelektross","cryogonal","hydreigon","vikavolt","giratina-origin","rotom-heat","rotom-wash","rotom-frost","rotom-fan","rotom-mow","latias-mega","latios-mega","vikavolt-totem","weezing-galar"]},"effect-spore":{"name":"effect-spore","description":"Contact may poison or cause paralysis or sleep.","effect_description":"Whenever a move makes contact with this Pokémon, the move's user has a 30% chance of being paralyzed, poisoned, or put to sleep, chosen at random.  Nothing is done to compensate if the move's user is immune to one of these ailments; there is simply a lower chance that the move's user will be affected.","short_effect_description":"Has a 30% chance of inflcting either paralysis, poison, or sleep on attacking Pokémon on contact.","pokemon":["vileplume","paras","parasect","shroomish","breloom","foongus","amoonguss","morelull","shiinotic","gossifleur","eldegoss"]},"synchronize":{"name":"synchronize","description":"Passes poison, paralyze, or burn to the Pokémon that inflicted it.","effect_description":"Whenever this Pokémon is burned, paralyzed, or poisoned, the Pokémon who gave this Pokémon that ailment is also given the ailment.  This ability passes back bad poison when this Pokémon is badly poisoned.  This ability cannot pass on a status ailment that the Pokémon did not directly receive from another Pokémon, such as the poison from toxic spikes or the burn from a flame orb.  Overworld: If the lead Pokémon has this ability, wild Pokémon have a 50% chance of having the lead Pokémon's nature, and a 50% chance of being given a random nature as usual, including the lead Pokémon's nature.  This does not work on Pokémon received outside of battle or roaming legendaries.","short_effect_description":"Copies burns, paralysis, and poison received onto the Pokémon that inflicted them.","pokemon":["abra","kadabra","alakazam","mew","natu","xatu","espeon","umbreon","ralts","kirlia","gardevoir","munna","musharna","elgyem","beheeyem","indeedee-male","indeedee-female"]},"clear-body":{"name":"clear-body","description":"Prevents other Pokémon from lowering its stats.","effect_description":"This Pokémon cannot have its stats lowered by other Pokémon.  This ability does not prevent any stat losses other than stat modifiers, such as the Speed cut from paralysis.  This Pokémon can still be passed negative stat modifiers through guard swap, heart swap, or power swap.  This ability functions identically to white smoke in battle.","short_effect_description":"Prevents stats from being lowered by other Pokémon.","pokemon":["tentacool","tentacruel","beldum","metang","metagross","regirock","regice","registeel","klink","klang","klinklang","carbink","diancie","dreepy","drakloak","dragapult"]},"natural-cure":{"name":"natural-cure","description":"All status conditions heal when the Pokémon switches out.","effect_description":"This Pokémon is cured of any major status ailment when it is switched out for another Pokémon.  If this ability is acquired during battle, the Pokémon is cured upon leaving battle before losing the temporary ability.","short_effect_description":"Cures any major status ailment upon switching out.","pokemon":["chansey","staryu","starmie","corsola","blissey","celebi","roselia","swablu","altaria","budew","roserade","happiny","shaymin-land","phantump","trevenant","comfey"]},"lightning-rod":{"name":"lightning-rod","description":"Draws in all Electric-type moves to boost its Sp. Atk stat.","effect_description":"All other Pokémon's single-target electric-type moves are redirected to this Pokémon if it is an eligible target.  Other Pokémon's Electric moves raise this Pokémon's Special Attack one stage, negating any other effect on it, and cannot miss it.  If the move's intended target also has this ability, the move is not redirected.  When multiple Pokémon with this ability are possible targets for redirection, the move is redirected to the one with the highest Speed stat, or, in the case of a tie, to a random tied Pokémon.  follow me takes precedence over this ability.  If the Pokémon is a ground-type and thus immune to Electric moves, its immunity prevents the Special Attack boost.","short_effect_description":"Redirects single-target electric moves to this Pokémon where possible.  Absorbs Electric moves, raising Special Attack one stage.","pokemon":["pikachu","raichu","cubone","marowak","rhyhorn","rhydon","goldeen","seaking","pichu","electrike","manectric","plusle","rhyperior","blitzle","zebstrika","togedemaru","pincurchin","sceptile-mega","pikachu-rock-star","pikachu-belle","pikachu-pop-star","pikachu-phd","pikachu-libre","pikachu-cosplay","pikachu-original-cap","pikachu-hoenn-cap","pikachu-sinnoh-cap","pikachu-unova-cap","pikachu-kalos-cap","pikachu-alola-cap","marowak-alola","pikachu-partner-cap","marowak-totem","togedemaru-totem","pikachu-gmax"]},"serene-grace":{"name":"serene-grace","description":"Boosts the likelihood of additional effects occurring.","effect_description":"This Pokémon's moves have twice their usual effect chance.  An effect chance is a move's chance to inflict a status ailment, cause a stat change, or make the target flinch in addition to the move's main effect.  For example, flamethrower's chance of burning the target is doubled, but protect's chance of success and air cutter's increased critical hit rate are unaffected.  secret power is unaffected.","short_effect_description":"Doubles the chance of moves' extra effects occurring.","pokemon":["chansey","togepi","togetic","dunsparce","blissey","jirachi","happiny","togekiss","deerling","sawsbuck","meloetta-aria","shaymin-sky","meloetta-pirouette"]},"swift-swim":{"name":"swift-swim","description":"Boosts the Pokémon’s Speed stat in rain.","effect_description":"This Pokémon's Speed is doubled during rain.  This bonus does not count as a stat modifier.","short_effect_description":"Doubles Speed during rain.","pokemon":["psyduck","golduck","poliwag","poliwhirl","poliwrath","horsea","goldeen","seaking","magikarp","omanyte","omastar","kabuto","kabutops","qwilfish","mantine","kingdra","lotad","lombre","ludicolo","surskit","anorith","armaldo","feebas","huntail","gorebyss","relicanth","luvdisc","buizel","floatzel","finneon","lumineon","mantyke","tympole","palpitoad","seismitoad","tirtouga","carracosta","beartic","chewtle","drednaw","arrokuda","barraskewda","swampert-mega","drednaw-gmax"]},"chlorophyll":{"name":"chlorophyll","description":"Boosts the Pokémon’s Speed stat in sunshine.","effect_description":"This Pokémon's Speed is doubled during strong sunlight.  This bonus does not count as a stat modifier.","short_effect_description":"Doubles Speed during strong sunlight.","pokemon":["bulbasaur","ivysaur","venusaur","oddish","gloom","vileplume","bellsprout","weepinbell","victreebel","exeggcute","exeggutor","tangela","bellossom","hoppip","skiploom","jumpluff","sunkern","sunflora","seedot","nuzleaf","shiftry","tropius","cherubi","tangrowth","leafeon","sewaddle","swadloon","leavanny","cottonee","whimsicott","petilil","lilligant","maractus","deerling","sawsbuck","venusaur-gmax"]},"illuminate":{"name":"illuminate","description":"Raises the likelihood of meeting wild Pokémon.","effect_description":"Overworld: If the lead Pokémon has this ability, the wild encounter rate is doubled.  This ability has no effect in battle.","short_effect_description":"Doubles the wild encounter rate.","pokemon":["staryu","starmie","chinchou","lanturn","volbeat","watchog","morelull","shiinotic"]},"trace":{"name":"trace","description":"The Pokémon copies an opposing Pokémon’s Ability.","effect_description":"When this Pokémon enters battle, it copies a random opponent's ability.  This ability cannot copy flower gift, forecast, illusion, imposter, multitype, trace, wonder guard, or zen mode.","short_effect_description":"Copies an opponent's ability upon entering battle.","pokemon":["porygon","porygon2","ralts","kirlia","gardevoir","alakazam-mega"]},"huge-power":{"name":"huge-power","description":"Boosts the Pokémon’s Attack stat.","effect_description":"This Pokémon's Attack is doubled while in battle.  This bonus does not count as a stat modifier.  This ability functions identically to pure power.","short_effect_description":"Doubles Attack in battle.","pokemon":["marill","azumarill","azurill","bunnelby","diggersby","mawile-mega"]},"poison-point":{"name":"poison-point","description":"Contact with the Pokémon may poison the attacker.","effect_description":"Whenever a move makes contact with this Pokémon, the move's user has a 30% chance of being poisoned.","short_effect_description":"Has a 30% chance of poisoning attacking Pokémon on contact.","pokemon":["nidoran-f","nidorina","nidoqueen","nidoran-m","nidorino","nidoking","seadra","qwilfish","roselia","budew","roserade","venipede","whirlipede","scolipede","skrelp","dragalge"]},"inner-focus":{"name":"inner-focus","description":"Protects the Pokémon from flinching.","effect_description":"This Pokémon cannot flinch.","short_effect_description":"Prevents flinching.","pokemon":["zubat","golbat","abra","kadabra","alakazam","farfetchd","drowzee","hypno","hitmonchan","kangaskhan","dragonite","crobat","umbreon","girafarig","sneasel","raikou","entei","suicune","snorunt","glalie","riolu","lucario","throh","sawk","darumaka","mienfoo","mienshao","pawniard","bisharp","mudbray","mudsdale","oranguru","indeedee-male","kubfu","gallade-mega","darumaka-galar"]},"magma-armor":{"name":"magma-armor","description":"Prevents the Pokémon from becoming frozen.","effect_description":"This Pokémon cannot be frozen.  If a Pokémon is frozen and acquires this ability, it will immediately thaw out; this includes when regaining a lost ability upon leaving battle.  Overworld: If any Pokémon in the party has this ability, each egg in the party has its hatch counter decreased by 2 (rather than 1) each step cycle, making eggs hatch roughly twice as quickly.  This effect does not stack if multiple Pokémon have this ability or flame body.","short_effect_description":"Prevents freezing.","pokemon":["slugma","magcargo","camerupt"]},"water-veil":{"name":"water-veil","description":"Prevents the Pokémon from getting a burn.","effect_description":"This Pokémon cannot be burned.  If a Pokémon is burned and acquires this ability, its burn is healed; this includes when regaining a lost ability upon leaving battle.","short_effect_description":"Prevents burns.","pokemon":["goldeen","seaking","mantine","wailmer","wailord","huntail","buizel","floatzel","finneon","lumineon","mantyke"]},"magnet-pull":{"name":"magnet-pull","description":"Prevents Steel-type Pokémon from escaping.","effect_description":"While this Pokémon is in battle, opposing steel-type Pokémon cannot flee or switch out.  Pokémon with run away can still flee.  Pokémon can still switch out with the use of a move or item.  Overworld: If the lead Pokémon has this ability, Steel-type Pokémon have a higher encounter rate.","short_effect_description":"Prevents steel opponents from fleeing or switching out.","pokemon":["magnemite","magneton","nosepass","magnezone","probopass","meltan","geodude-alola","graveler-alola","golem-alola"]},"soundproof":{"name":"soundproof","description":"Gives full immunity to all sound-based moves.","effect_description":"This Pokémon is immune to moves flagged as being sound-based.  heal bell is unaffected.  uproar still prevents this Pokémon from sleeping.  This Pokémon can still receive a Perish Song counter through baton pass, and will retain a Perish Song counter if it acquires this ability after Perish Song is used.  howl, roar of time, sonic boom, and yawn are not flagged as sound-based.","short_effect_description":"Protects against sound-based moves.","pokemon":["voltorb","electrode","mr-mime","whismur","loudred","exploud","shieldon","bastiodon","mime-jr","snover","abomasnow","bouffalant","jangmo-o","hakamo-o","kommo-o","kommo-o-totem"]},"rain-dish":{"name":"rain-dish","description":"The Pokémon gradually regains HP in rain.","effect_description":"This Pokémon heals for 1/16 of its maximum HP after each turn during rain.","short_effect_description":"Heals for 1/16 max HP after each turn during rain.","pokemon":["squirtle","wartortle","blastoise","tentacool","tentacruel","lotad","lombre","ludicolo","wingull","pelipper","surskit","morelull","shiinotic","blastoise-gmax"]},"sand-stream":{"name":"sand-stream","description":"The Pokémon summons a sandstorm in battle.","effect_description":"The weather changes to a sandstorm when this Pokémon enters battle and does not end unless cancelled by another weather condition.  If multiple Pokémon with this ability, drizzle, drought, or snow warning are sent out at the same time, the abilities will activate in order of Speed, respecting trick room.  Each ability's weather will cancel the previous weather, and only the weather summoned by the slowest of the Pokémon will stay.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is halved in a sandstorm.","short_effect_description":"Summons a sandstorm that lasts indefinitely upon entering battle.","pokemon":["tyranitar","hippopotas","hippowdon","gigalith","tyranitar-mega"]},"pressure":{"name":"pressure","description":"The Pokémon raises opposing Pokémon’s PP usage.","effect_description":"Moves targetting this Pokémon use one extra PP.  This ability stacks if multiple targets have it.  This ability still affects moves that fail or miss.  This ability does not affect ally moves that target either the entire field or just its side, nor this Pokémon's self-targetted moves; it does, however, affect single-targetted ally moves aimed at this Pokémon, ally moves that target all other Pokémon, and opponents' moves that target the entire field.  If this ability raises a move's PP cost above its remaining PP, it will use all remaining PP.  When this Pokémon enters battle, all participating trainers are notified that it has this ability.  Overworld: If the lead Pokémon has this ability, higher-levelled Pokémon have their encounter rate increased.","short_effect_description":"Increases the PP cost of moves targetting the Pokémon by one.","pokemon":["aerodactyl","articuno","zapdos","moltres","mewtwo","raikou","entei","suicune","lugia","ho-oh","wailmer","wailord","dusclops","absol","deoxys-normal","vespiquen","spiritomb","weavile","dusknoir","dialga","palkia","giratina-altered","pawniard","bisharp","kyurem","corviknight","eternatus","deoxys-attack","deoxys-defense","deoxys-speed","corviknight-gmax","eternatus-eternamax"]},"thick-fat":{"name":"thick-fat","description":"Boosts resistance to Fire-​ and Ice-type moves.","effect_description":"This Pokémon takes half as much damage from fire- and ice-type moves.","short_effect_description":"Halves damage from fire and ice moves.","pokemon":["seel","dewgong","snorlax","marill","azumarill","swinub","piloswine","miltank","makuhita","hariyama","azurill","spoink","grumpig","spheal","sealeo","walrein","purugly","munchlax","mamoswine","tepig","pignite","appletun","venusaur-mega","rattata-alola","raticate-alola","raticate-totem-alola","snorlax-gmax","appletun-gmax"]},"early-bird":{"name":"early-bird","description":"The Pokémon awakens quickly from sleep.","effect_description":"This Pokémon's remaining sleep turn count falls by 2 rather than 1.  If this Pokémon's sleep counter is at 1, it will fall to 0 and then the Pokémon will wake up.","short_effect_description":"Makes sleep pass twice as quickly.","pokemon":["doduo","dodrio","kangaskhan","ledyba","ledian","natu","xatu","sunkern","sunflora","girafarig","houndour","houndoom","seedot","nuzleaf","shiftry"]},"flame-body":{"name":"flame-body","description":"Contact with the Pokémon may burn the attacker.","effect_description":"Whenever a move makes contact with this Pokémon, the move's user has a 30% chance of being burned.  Overworld: If any Pokémon in the party has this ability, each egg in the party has its hatch counter decreased by 2 (rather than 1) each step cycle, making eggs hatch roughly twice as quickly.  This effect does not stack if multiple Pokémon have this ability or magma armor.","short_effect_description":"Has a 30% chance of burning attacking Pokémon on contact.","pokemon":["ponyta","rapidash","magmar","moltres","slugma","magcargo","magby","magmortar","heatran","litwick","lampent","chandelure","larvesta","volcarona","fletchinder","talonflame","carkol","coalossal","sizzlipede","centiskorch","coalossal-gmax","centiskorch-gmax"]},"run-away":{"name":"run-away","description":"Enables a sure getaway from wild Pokémon.","effect_description":"This Pokémon is always successful fleeing from wild battles, even if trapped by a move or ability.","short_effect_description":"Ensures success fleeing from wild battles.","pokemon":["caterpie","weedle","rattata","raticate","oddish","venonat","ponyta","rapidash","doduo","dodrio","eevee","sentret","furret","aipom","dunsparce","snubbull","poochyena","wurmple","nincada","kricketot","pachirisu","buneary","patrat","lillipup","nickit","thievul","wooloo","dubwool","ponyta-galar","rapidash-galar","eevee-gmax"]},"keen-eye":{"name":"keen-eye","description":"Prevents other Pokémon from lowering accuracy.","effect_description":"This Pokémon cannot have its accuracy lowered.  This ability does not prevent any accuracy losses other than stat modifiers, such as the accuracy cut from fog; nor does it prevent other Pokémon's evasion from making this Pokémon's moves less accurate.  This Pokémon can still be passed negative accuracy modifiers through heart swap.  Overworld: If the first Pokémon in the party has this ability, any random encounter with a Pokémon five or more levels lower than it has a 50% chance of being skipped.","short_effect_description":"Prevents accuracy from being lowered.","pokemon":["pidgey","pidgeotto","pidgeot","spearow","fearow","farfetchd","hitmonchan","sentret","furret","hoothoot","noctowl","sneasel","skarmory","wingull","pelipper","sableye","starly","glameow","stunky","skuntank","chatot","skorupi","drapion","patrat","watchog","ducklett","swanna","rufflet","braviary","espurr","meowstic-male","pikipek","trumbeak","toucannon","rockruff","lycanroc-midday","rookidee","corvisquire","meowstic-female","lycanroc-midnight"]},"hyper-cutter":{"name":"hyper-cutter","description":"Prevents other Pokémon from lowering its Attack stat.","effect_description":"This Pokémon's Attack cannot be lowered by other Pokémon.  This ability does not prevent any Attack losses other than stat modifiers, such as the Attack cut from a burn.  This Pokémon can still be passed negative Attack modifiers through heart swap or power swap.","short_effect_description":"Prevents Attack from being lowered by other Pokémon.","pokemon":["krabby","kingler","pinsir","gligar","mawile","trapinch","corphish","crawdaunt","gliscor","crabrawler","crabominable","kingler-gmax"]},"pickup":{"name":"pickup","description":"The Pokémon may pick up items.","effect_description":"At the end of each turn, if another Pokémon consumed or Flung a held item that turn, this Pokémon picks up the item if it is not already holding one.  After each battle, this Pokémon has a 10% chance of picking up an item if it is not already holding one.  The air balloon and eject button cannot be picked up.  The items that may be found vary by game, and, since Pokémon Emerald, by the Pokémon's level.  This ability is checked after the battle ends, at which point any temporary ability changes have worn off.","short_effect_description":"Picks up other Pokémon's used and Flung held items.  May also pick up an item after battle.","pokemon":["meowth","aipom","teddiursa","phanpy","zigzagoon","linoone","pachirisu","ambipom","munchlax","lillipup","bunnelby","diggersby","dedenne","pumpkaboo-average","gourgeist-average","pikipek","trumbeak","pumpkaboo-small","pumpkaboo-large","pumpkaboo-super","gourgeist-small","gourgeist-large","gourgeist-super","meowth-alola","meowth-galar","zigzagoon-galar","linoone-galar","meowth-gmax"]},"truant":{"name":"truant","description":"The Pokémon can’t attack on consecutive turns.","effect_description":"Every second turn on which this Pokémon should attempt to use a move, it will instead do nothing (\"loaf around\").  Loafing around interrupts moves that take multiple turns the same way paralysis, flinching, etc do.  Most such moves, for example bide or rollout, are simply cut off upon loafing around.  Attacks with a recharge turn, such as hyper beam, do not have to recharge; attacks with a preparation turn, such as fly, do not end up being used.  Moves that are forced over multiple turns and keep going through failure, such as outrage, uproar, or any move forced by encore, keep going as usual.  If this Pokémon is confused, its confusion is not checked when loafing around; the Pokémon cannot hurt itself, and its confusion does not end or come closer to ending.  If this Pokémon attempts to move but fails, e.g. because of paralysis or gravity, it still counts as having moved and will loaf around the next turn.  If it does not attempt to move, e.g. because it is asleep or frozen, whatever it would have done will be postponed until its next attempt; that is, it will either loaf around or move as usual, depending on what it last did.  This ability cannot be changed with worry seed, but it can be disabled with gastro acid, changed with role play, or traded away with skill swap.","short_effect_description":"Skips every second turn.","pokemon":["slakoth","slaking","durant"]},"hustle":{"name":"hustle","description":"Boosts the Attack stat, but lowers accuracy.","effect_description":"This Pokémon's physical moves do 1.5× as much regular damage, but have 0.8× their usual accuracy.  Special moves are unaffected.  Moves that do set damage, such as seismic toss, have their accuracy affected, but not their damage.  Overworld: If the lead Pokémon has this ability, higher-levelled Pokémon have their encounter rate increased.","short_effect_description":"Strengthens physical moves to inflict 1.5× damage, but decreases their accuracy to 0.8×.","pokemon":["rattata","raticate","nidoran-f","nidorina","nidoran-m","nidorino","togepi","togetic","corsola","remoraid","delibird","combee","togekiss","darumaka","rufflet","durant","deino","zweilous","flapple","dracozolt","rattata-alola","raticate-alola","raticate-totem-alola","darumaka-galar","flapple-gmax"]},"cute-charm":{"name":"cute-charm","description":"Contact with the Pokémon may cause infatuation.","effect_description":"Whenever a move makes contact with this Pokémon, the move's user has a 30% chance of being infatuated.  Overworld: If the first Pokémon in the party has this ability, any wild Pokémon whose species can be either gender has a 2/3 chance of being set to the opposite gender, and a 1/3 chance of having a random gender as usual.","short_effect_description":"Has a 30% chance of infatuating attacking Pokémon on contact.","pokemon":["clefairy","clefable","jigglypuff","wigglytuff","cleffa","igglybuff","skitty","delcatty","milotic","lopunny","minccino","cinccino","sylveon","stufful"]},"plus":{"name":"plus","description":"Boosts the Sp. Atk stat if another Pokémon has Plus or Minus.","effect_description":"This Pokémon has 1.5× its Special Attack if any friendly Pokémon has plus or minus.  This bonus does not count as a stat modifier.  If either ability is disabled by gastro acid, both lose their effect.","short_effect_description":"Increases Special Attack to 1.5× when a friendly Pokémon has plus or minus.","pokemon":["mareep","flaaffy","ampharos","plusle","klink","klang","klinklang","dedenne","toxtricity-amped","toxtricity-amped-gmax"]},"minus":{"name":"minus","description":"Boosts the Sp. Atk stat if another Pokémon has Plus or Minus.","effect_description":"This Pokémon has 1.5× its Special Attack if any friendly Pokémon has plus or minus.  This bonus does not count as a stat modifier.  If either ability is disabled by gastro acid, both lose their effect.","short_effect_description":"Increases Special Attack to 1.5× when a friendly Pokémon has plus or minus.","pokemon":["electrike","manectric","minun","klink","klang","klinklang","toxtricity-low-key","toxtricity-low-key-gmax"]},"forecast":{"name":"forecast","description":"Castform transforms with the weather.","effect_description":"During rain, strong sunlight, or hail, this Pokémon's type changes to water, fire, or ice, respectively, and its form changes to match.  This ability has no effect for any Pokémon other than castform.  If the weather ends or becomes anything that does not trigger this ability, or a Pokémon with air lock or cloud nine enters battle, this Pokémon's type and form revert to their default.  If this ability is lost or disabled, this Pokémon cannot change its current type and form until it regains its ability.","short_effect_description":"Changes castform's type and form to match the weather.","pokemon":["castform","castform-sunny","castform-rainy","castform-snowy"]},"sticky-hold":{"name":"sticky-hold","description":"Protects the Pokémon from item theft.","effect_description":"This Pokémon's hold item cannot be removed by other Pokémon.  Damaging moves that would remove this Pokémon's item can still inflict damage against this Pokémon, e.g. knock off or pluck.  This Pokémon can still use moves that involve the loss of its own item, e.g. fling or trick.  Overworld: If the lead Pokémon has this ability, the encounter rate while fishing is increased.","short_effect_description":"Prevents a held item from being removed by other Pokémon.","pokemon":["grimer","muk","gulpin","swalot","shellos","gastrodon","trubbish","accelgor"]},"shed-skin":{"name":"shed-skin","description":"The Pokémon may heal its own status conditions.","effect_description":"After each turn, this Pokémon has a 33% of being cured of any major status ailment.","short_effect_description":"Has a 33% chance of curing any major status ailment after each turn.","pokemon":["metapod","kakuna","ekans","arbok","dratini","dragonair","pupitar","silcoon","cascoon","seviper","kricketot","burmy","scraggy","scrafty","karrablast","spewpa","silicobra","sandaconda","sandaconda-gmax"]},"guts":{"name":"guts","description":"Boosts the Attack stat if the Pokémon has a status condition.","effect_description":"Whenever this Pokémon is asleep, burned, paralyzed, or poisoned, it has 1.5× its Attack.  This Pokémon is not affected by the usual Attack cut from a burn.  This bonus does not count as a stat modifier.","short_effect_description":"Increases Attack to 1.5× with a major status ailment.","pokemon":["rattata","raticate","machop","machoke","machamp","flareon","heracross","ursaring","tyrogue","larvitar","taillow","swellow","makuhita","hariyama","shinx","luxio","luxray","timburr","gurdurr","conkeldurr","throh","obstagoon","machamp-gmax"]},"marvel-scale":{"name":"marvel-scale","description":"Boosts the Defense stat if the Pokémon has a status condition.","effect_description":"Whenever this Pokémon has a major status ailment, it has 1.5× its Defense.  This bonus does not count as a stat modifier.","short_effect_description":"Increases Defense to 1.5× with a major status ailment.","pokemon":["dratini","dragonair","milotic"]},"liquid-ooze":{"name":"liquid-ooze","description":"Damages attackers using any draining move.","effect_description":"Whenever a Pokémon would heal after hitting this Pokémon with a leeching move like absorb, it instead loses as many HP as it would usually gain.  dream eater is unaffected.","short_effect_description":"Damages opponents using leeching moves for as much as they would heal.","pokemon":["tentacool","tentacruel","gulpin","swalot"]},"overgrow":{"name":"overgrow","description":"Powers up Grass-type moves when the Pokémon is in trouble.","effect_description":"When this Pokémon has 1/3 or less of its HP remaining, its grass-type moves inflict 1.5× as much regular damage.","short_effect_description":"Strengthens grass moves to inflict 1.5× damage at 1/3 max HP or less.","pokemon":["bulbasaur","ivysaur","venusaur","chikorita","bayleef","meganium","treecko","grovyle","sceptile","turtwig","grotle","torterra","snivy","servine","serperior","pansage","simisage","chespin","quilladin","chesnaught","rowlet","dartrix","decidueye","grookey","thwackey","rillaboom","venusaur-gmax","rillaboom-gmax"]},"blaze":{"name":"blaze","description":"Powers up Fire-type moves when the Pokémon is in trouble.","effect_description":"When this Pokémon has 1/3 or less of its HP remaining, its fire-type moves inflict 1.5× as much regular damage.","short_effect_description":"Strengthens fire moves to inflict 1.5× damage at 1/3 max HP or less.","pokemon":["charmander","charmeleon","charizard","cyndaquil","quilava","typhlosion","torchic","combusken","blaziken","chimchar","monferno","infernape","tepig","pignite","emboar","pansear","simisear","fennekin","braixen","delphox","litten","torracat","incineroar","scorbunny","raboot","cinderace","charizard-gmax","cinderace-gmax"]},"torrent":{"name":"torrent","description":"Powers up Water-type moves when the Pokémon is in trouble.","effect_description":"When this Pokémon has 1/3 or less of its HP remaining, its water-type moves inflict 1.5× as much regular damage.","short_effect_description":"Strengthens water moves to inflict 1.5× damage at 1/3 max HP or less.","pokemon":["squirtle","wartortle","blastoise","totodile","croconaw","feraligatr","mudkip","marshtomp","swampert","piplup","prinplup","empoleon","oshawott","dewott","samurott","panpour","simipour","froakie","frogadier","greninja","popplio","brionne","primarina","sobble","drizzile","inteleon","blastoise-gmax","inteleon-gmax"]},"swarm":{"name":"swarm","description":"Powers up Bug-type moves when the Pokémon is in trouble.","effect_description":"When this Pokémon has 1/3 or less of its HP remaining, its bug-type moves inflict 1.5× as much regular damage.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is increased.","short_effect_description":"Strengthens bug moves to inflict 1.5× damage at 1/3 max HP or less.","pokemon":["beedrill","scyther","ledyba","ledian","spinarak","ariados","scizor","heracross","beautifly","volbeat","kricketune","mothim","sewaddle","leavanny","venipede","whirlipede","scolipede","karrablast","escavalier","joltik","galvantula","durant","larvesta","volcarona","grubbin","blipbug","dottler","orbeetle","orbeetle-gmax"]},"rock-head":{"name":"rock-head","description":"Protects the Pokémon from recoil damage.","effect_description":"This Pokémon does not receive recoil damage from its recoil moves.  struggle's recoil is unaffected.  This ability does not prevent crash damage from missing with jump kick or high jump kick.","short_effect_description":"Protects against recoil damage.","pokemon":["geodude","graveler","golem","onix","cubone","marowak","rhyhorn","rhydon","aerodactyl","sudowoodo","steelix","aron","lairon","aggron","relicanth","bagon","shelgon","bonsly","tyrantrum","basculin-blue-striped","marowak-alola","marowak-totem"]},"drought":{"name":"drought","description":"Turns the sunlight harsh when the Pokémon enters a battle.","effect_description":"The weather changes to strong sunlight when this Pokémon enters battle and does not end unless cancelled by another weather condition.  If multiple Pokémon with this ability, drizzle, sand stream, or snow warning are sent out at the same time, the abilities will activate in order of Speed, respecting trick room.  Each ability's weather will cancel the previous weather, and only the weather summoned by the slowest of the Pokémon will stay.","short_effect_description":"Summons strong sunlight that lasts indefinitely upon entering battle.","pokemon":["vulpix","ninetales","torkoal","groudon","charizard-mega-y"]},"arena-trap":{"name":"arena-trap","description":"Prevents opposing Pokémon from fleeing.","effect_description":"While this Pokémon is in battle, opposing Pokémon cannot flee or switch out.  flying-type Pokémon and Pokémon in the air, e.g. due to levitate or magnet rise, are unaffected.  Pokémon with run away can still flee.  Pokémon can still switch out with the use of a move or item.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is doubled.","short_effect_description":"Prevents opponents from fleeing or switching out.  Eluded by flying-types and Pokémon in the air.","pokemon":["diglett","dugtrio","trapinch"]},"vital-spirit":{"name":"vital-spirit","description":"Prevents the Pokémon from falling asleep.","effect_description":"This Pokémon cannot be asleep.  This causes rest to fail altogether.  If a Pokémon is asleep and acquires this ability, it will immediately wake up; this includes when regaining a lost ability upon leaving battle.  This ability functions identically to insomnia in battle.  Overworld: If the lead Pokémon has this ability, higher-levelled Pokémon have their encounter rate increased.","short_effect_description":"Prevents sleep.","pokemon":["mankey","primeape","electabuzz","magmar","delibird","tyrogue","elekid","magby","vigoroth","electivire","magmortar","lillipup","rockruff","lycanroc-midnight","mr-mime-galar"]},"white-smoke":{"name":"white-smoke","description":"Prevents other Pokémon from lowering its stats.","effect_description":"This Pokémon cannot have its stats lowered by other Pokémon.  This ability does not prevent any stat losses other than stat modifiers, such as the Speed cut from paralysis; nor self-inflicted stat drops, such as the Special Attack drop from overheat; nor opponent-triggered stat boosts, such as the Attack boost from swagger.  This Pokémon can still be passed negative stat modifiers through guard swap, heart swap, or power swap.  This ability functions identically to clear body in battle.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is halved.","short_effect_description":"Prevents stats from being lowered by other Pokémon.","pokemon":["torkoal","heatmor","sizzlipede","centiskorch","centiskorch-gmax"]},"pure-power":{"name":"pure-power","description":"Boosts the Pokémon’s Attack stat.","effect_description":"This Pokémon's Attack is doubled in battle.  This bonus does not count as a stat modifier.  This ability functions identically to huge power.","short_effect_description":"Doubles Attack in battle.","pokemon":["meditite","medicham","medicham-mega"]},"shell-armor":{"name":"shell-armor","description":"Protects the Pokémon from critical hits.","effect_description":"Moves cannot score critical hits against this Pokémon.  This ability functions identically to battle armor.","short_effect_description":"Protects against critical hits.","pokemon":["shellder","cloyster","krabby","kingler","lapras","omanyte","omastar","torkoal","corphish","crawdaunt","clamperl","turtwig","grotle","torterra","oshawott","dewott","samurott","dwebble","crustle","escavalier","shelmet","turtonator","chewtle","drednaw","slowbro-mega","kingler-gmax","lapras-gmax","drednaw-gmax"]},"air-lock":{"name":"air-lock","description":"Eliminates the effects of weather.","effect_description":"While this Pokémon is in battle, weather can still be in play, but will not have any of its effects.  This ability functions identically to cloud nine.","short_effect_description":"Negates all effects of weather, but does not prevent the weather itself.","pokemon":["rayquaza"]},"tangled-feet":{"name":"tangled-feet","description":"Raises evasion if the Pokémon is confused.","effect_description":"When this Pokémon is confused, it has twice its evasion.","short_effect_description":"Doubles evasion when confused.","pokemon":["pidgey","pidgeotto","pidgeot","doduo","dodrio","spinda","chatot","mr-rime"]},"motor-drive":{"name":"motor-drive","description":"Boosts the Speed stat when it’s hit by an Electric-type move.","effect_description":"Whenever an electric-type move hits this Pokémon, its Speed rises one stage, negating any other effect on it.  This ability will not take effect if this Pokémon is immune to Electric moves.  Electric moves will ignore this Pokémon's substitute.  This effect includes non-damaging moves, i.e. thunder wave.","short_effect_description":"Absorbs electric moves, raising Speed one stage.","pokemon":["electivire","blitzle","zebstrika","emolga"]},"rivalry":{"name":"rivalry","description":"Deals more damage to Pokémon of the same gender.","effect_description":"This Pokémon inflicts 1.25× as much regular damage against Pokémon of the same gender and 0.75× as much regular damage against Pokémon of the opposite gender.  If either Pokémon is genderless, damage is unaffected.","short_effect_description":"Increases damage inflicted to 1.25× against Pokémon of the same gender, but decreases damage to 0.75× against the opposite gender.","pokemon":["nidoran-f","nidorina","nidoqueen","nidoran-m","nidorino","nidoking","beautifly","shinx","luxio","luxray","pidove","tranquill","unfezant","axew","fraxure","haxorus","litleo","pyroar"]},"steadfast":{"name":"steadfast","description":"Boosts the Speed stat each time the Pokémon flinches.","effect_description":"Whenever this Pokémon flinches, its Speed rises one stage.","short_effect_description":"Raises Speed one stage upon flinching.","pokemon":["machop","machoke","machamp","scyther","tyrogue","hitmontop","riolu","lucario","gallade","rockruff","lycanroc-midday","sirfetchd","mewtwo-mega-x","farfetchd-galar","machamp-gmax"]},"snow-cloak":{"name":"snow-cloak","description":"Boosts evasion in a hailstorm.","effect_description":"During hail, this Pokémon has 1.25× its evasion, and it does not take hail damage regardless of type.  The evasion bonus does not count as a stat modifier.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is halved in snow.","short_effect_description":"Increases evasion to 1.25× during hail.  Protects against hail damage.","pokemon":["articuno","swinub","piloswine","glaceon","mamoswine","froslass","vanillite","vanillish","cubchoo","beartic","sandshrew-alola","sandslash-alola","vulpix-alola","ninetales-alola"]},"gluttony":{"name":"gluttony","description":"Makes the Pokémon use a held Berry earlier than usual.","effect_description":"This Pokémon eats any held Berry triggered by low HP when it falls below 50% of its HP, regardless of the Berry's usual threshold.","short_effect_description":"Makes the Pokémon eat any held Berry triggered by low HP below 1/2 its max HP.","pokemon":["bellsprout","weepinbell","victreebel","snorlax","shuckle","zigzagoon","linoone","gulpin","swalot","spoink","grumpig","munchlax","pansage","simisage","pansear","simisear","panpour","simipour","heatmor","skwovet","greedent","applin","flapple","appletun","rattata-alola","raticate-alola","raticate-totem-alola","grimer-alola","muk-alola","slowpoke-galar","zigzagoon-galar","linoone-galar","snorlax-gmax","flapple-gmax","appletun-gmax"]},"anger-point":{"name":"anger-point","description":"Maxes the Attack stat after the Pokémon takes a critical hit.","effect_description":"Whenever this Pokémon receives a critical hit, its Attack rises to the maximum of 6 stages.  This ability will still take effect if the critical hit is received by a substitute.","short_effect_description":"Raises Attack to the maximum of six stages upon receiving a critical hit.","pokemon":["mankey","primeape","tauros","camerupt","sandile","krokorok","krookodile","crabrawler","crabominable"]},"unburden":{"name":"unburden","description":"Boosts the Speed stat if its held item is used or lost.","effect_description":"When this Pokémon uses or loses its held item, its Speed is doubled.  If it gains another item or leaves battle, this bonus is lost.  This includes when the Pokémon drops its item because of knock off.  This bonus does not count as a stat modifier.  There is no notification when this ability takes effect.","short_effect_description":"Doubles Speed upon using or losing a held item.","pokemon":["hitmonlee","treecko","grovyle","sceptile","drifloon","drifblim","purrloin","liepard","accelgor","swirlix","slurpuff","hawlucha","nickit","thievul"]},"heatproof":{"name":"heatproof","description":"Weakens the power of Fire-type moves.","effect_description":"This Pokémon takes half as much damage from fire-type moves and burns.","short_effect_description":"Halves damage from fire moves and burns.","pokemon":["bronzor","bronzong","rolycoly"]},"simple":{"name":"simple","description":"The Pokémon is prone to wild stat changes.","effect_description":"Each stage of this Pokémon's stat modifiers acts as two stages.  These doubled stages are still limited to a minimum of -6 and a maximum of 6.  This Pokémon can still accumulate less than -3 or more than 3 stages of stat modifiers, even though the extra ones have no effect after doubling.","short_effect_description":"Doubles the Pokémon's stat modifiers.  These doubled modifiers are still capped at -6 or 6 stages.","pokemon":["numel","bidoof","bibarel","woobat","swoobat"]},"dry-skin":{"name":"dry-skin","description":"Reduces HP if it’s hot. Water restores HP.","effect_description":"This Pokémon takes 1/8 of its maximum HP in damage after each turn during strong sunlight, but it heals for 1/8 of its HP each turn during rain.  This Pokémon takes 1.25× as much damage from fire-type moves, but whenever a water move hits it, it heals for 1/4 its maximum HP instead.","short_effect_description":"Causes 1/8 max HP in damage each turn during strong sunlight, but heals for 1/8 max HP during rain.  Increases damage from fire moves to 1.25×, but absorbs water moves, healing for 1/4 max HP.","pokemon":["paras","parasect","jynx","croagunk","toxicroak","helioptile","heliolisk"]},"download":{"name":"download","description":"Adjusts power based on an opposing Pokémon’s stats.","effect_description":"When this Pokémon enters battle, its Attack or Special Attack, whichever corresponds to its opponents' weaker total defensive stat, rises one stage.  In the event of a tie, Special Attack is raised.  This ability also takes effect when acquired during a battle.","short_effect_description":"Raises the attack stat corresponding to the opponents' weaker defense one stage upon entering battle.","pokemon":["porygon","porygon2","porygon-z","genesect"]},"iron-fist":{"name":"iron-fist","description":"Powers up punching moves.","effect_description":"Moves flagged as being punch-based have 1.2× their base power for this Pokémon.  sucker punch is not flagged as punch-based; its original, Japanese name only means \"surprise attack\".","short_effect_description":"Strengthens punch-based moves to 1.2× their power.","pokemon":["hitmonchan","ledian","chimchar","monferno","infernape","timburr","gurdurr","conkeldurr","golett","golurk","pancham","pangoro","crabrawler","crabominable","melmetal","melmetal-gmax"]},"poison-heal":{"name":"poison-heal","description":"Restores HP if the Pokémon is poisoned.","effect_description":"If this Pokémon is poisoned, it will heal for 1/8 of its maximum HP after each turn rather than taking damage.  This includes bad poison.","short_effect_description":"Heals for 1/8 max HP after each turn when poisoned in place of damage.","pokemon":["shroomish","breloom","gliscor"]},"adaptability":{"name":"adaptability","description":"Powers up moves of the same type as the Pokémon.","effect_description":"This Pokémon inflicts twice as much damage with moves whose types match its own, rather than the usual same-type attack bonus of 1.5×.","short_effect_description":"Increases the same-type attack bonus from 1.5× to 2×.","pokemon":["eevee","corphish","crawdaunt","feebas","porygon-z","basculin-red-striped","skrelp","dragalge","yungoos","gumshoos","basculin-blue-striped","lucario-mega","beedrill-mega","gumshoos-totem","eevee-gmax"]},"skill-link":{"name":"skill-link","description":"Increases the number of times multi-strike moves hit.","effect_description":"This Pokémon always hits five times with two-to-five-hit moves, such as icicle spear.  It also bypasses the accuracy checks on triple kick's second and third hits.","short_effect_description":"Extends two-to-five-hit moves and triple kick to their full length every time.","pokemon":["shellder","cloyster","aipom","ambipom","minccino","cinccino","pikipek","trumbeak","toucannon","heracross-mega"]},"hydration":{"name":"hydration","description":"Heals status conditions if it’s raining.","effect_description":"This Pokémon is cured of any major status ailment after each turn during rain.","short_effect_description":"Cures any major status ailment after each turn during rain.","pokemon":["seel","dewgong","lapras","vaporeon","smoochum","wingull","barboach","whiscash","gorebyss","luvdisc","phione","manaphy","tympole","palpitoad","ducklett","swanna","alomomola","shelmet","accelgor","goomy","sliggoo","goodra","lapras-gmax"]},"solar-power":{"name":"solar-power","description":"Boosts the Sp. Atk stat in sunny weather, but HP decreases.","effect_description":"During strong sunlight, this Pokémon has 1.5× its Special Attack but takes 1/8 of its maximum HP in damage after each turn.","short_effect_description":"Increases Special Attack to 1.5× but costs 1/8 max HP after each turn during strong sunlight.","pokemon":["charmander","charmeleon","charizard","sunkern","sunflora","tropius","helioptile","heliolisk","houndoom-mega","charizard-gmax"]},"quick-feet":{"name":"quick-feet","description":"Boosts the Speed stat if the Pokémon has a status condition.","effect_description":"Whenever this Pokémon has a major status ailment, it has 1.5× its Speed.  This Pokémon is not affected by the usual Speed cut from paralysis.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is halved.","short_effect_description":"Increases Speed to 1.5× with a major status ailment.","pokemon":["jolteon","granbull","teddiursa","ursaring","poochyena","mightyena","zigzagoon","linoone","shroomish","zigzagoon-galar","linoone-galar"]},"normalize":{"name":"normalize","description":"All the Pokémon’s moves become Normal type.","effect_description":"This Pokémon's moves all act as if they were normal-type.  Moves that inflict typeless damage do so as usual.  Moves of variable type, such as hidden power, are affected.  They otherwise work as usual, however; weather ball, for example, is always forced to be Normal, but it still has doubled power and looks different during weather.  As thunder wave is prevented by immunities, unlike most non-damaging moves, it does not affect ghost-type Pokémon under the effect of this ability.","short_effect_description":"Makes the Pokémon's moves all act normal-type.","pokemon":["skitty","delcatty"]},"sniper":{"name":"sniper","description":"Powers up moves if they become critical hits.","effect_description":"This Pokémon inflicts triple damage with critical hits, rather than the usual double damage.","short_effect_description":"Strengthens critical hits to inflict 3× damage rather than 2×.","pokemon":["beedrill","spearow","fearow","horsea","seadra","spinarak","ariados","remoraid","octillery","kingdra","skorupi","drapion","binacle","barbaracle","sobble","drizzile","inteleon","inteleon-gmax"]},"magic-guard":{"name":"magic-guard","description":"The Pokémon only takes damage from attacks.","effect_description":"This Pokémon is immune to damage not directly caused by a move.  For example, this Pokémon takes no damage from from weather, recoil, status ailments, or spikes, but it still suffers from the Attack cut when burned, and a life orb will still power up this Pokémon's moves without damaging it.  Anything that directly depends on such damage will also not happen; for example, leech seed will neither hurt this Pokémon nor heal the opponent, and Pokémon with a jaboca berry or rowap berry will not consume the berry when hit by this Pokémon.  The following are unaffected: struggle, pain split (whether used by or against this Pokémon), belly drum, substitute, curse, moves that knock the user out, and damage from confusion.  This Pokémon will neither lose nor regain HP if it drains HP from a Pokémon with liquid ooze.  If this Pokémon is badly poisoned, the poison counter is still increased each turn; if the Pokémon loses this ability, it will begin taking as much damage as it would be if it had been taking increasing damage each turn.","short_effect_description":"Protects against damage not directly caused by a move.","pokemon":["clefairy","clefable","abra","kadabra","alakazam","cleffa","sigilyph","solosis","duosion","reuniclus"]},"no-guard":{"name":"no-guard","description":"Ensures attacks by or against the Pokémon land.","effect_description":"Moves used by or against this Pokémon never miss.  One-hit KO moves are unaffected.  Moves affected by this ability can hit Pokémon during the preparation turn of moves like dig or fly.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is doubled.","short_effect_description":"Ensures all moves used by and against the Pokémon hit.","pokemon":["machop","machoke","machamp","karrablast","golett","golurk","honedge","doublade","pidgeot-mega","lycanroc-midnight","machamp-gmax"]},"stall":{"name":"stall","description":"The Pokémon moves after all other Pokémon do.","effect_description":"This Pokémon moves last within its priority bracket.  Multiple Pokémon with this ability move in order of Speed amongst themselves.  The full incense and lagging tail take precedence over this ability; that is, Pokémon with these items move after Pokémon with this ability.  Pokémon with both this ability and one of these items are delayed as much as if they had only the item.  This ability works as usual during trick room: Pokémon with this ability will move in reverse order of Speed after Pokémon without it.","short_effect_description":"Makes the Pokémon move last within its move's priority bracket.","pokemon":["sableye"]},"technician":{"name":"technician","description":"Powers up the Pokémon’s weaker moves.","effect_description":"This Pokémon's moves have 1.5× their power if their base power is 60 or less.  This includes moves of variable power, such as hidden power and magnitude, when their power is 60 or less.  helping hand's power boost is taken into account for any move, as is defense curl's power boost for rollout.","short_effect_description":"Strengthens moves of 60 base power or less to 1.5× their power.","pokemon":["meowth","persian","mr-mime","scyther","scizor","smeargle","hitmontop","breloom","kricketune","roserade","ambipom","mime-jr","minccino","cinccino","marshadow","toxtricity-amped","clobbopus","grapploct","scizor-mega","meowth-alola","persian-alola","toxtricity-low-key","meowth-gmax","toxtricity-amped-gmax","toxtricity-low-key-gmax"]},"leaf-guard":{"name":"leaf-guard","description":"Prevents status conditions in sunny weather.","effect_description":"This Pokémon cannot be given a major status ailment during strong sunlight.  This ability does not heal prior status ailments.  rest will fail altogether with this ability in effect.  yawn will immediately fail if used on this Pokémon during strong sunlight, and an already-used Yawn will fail if the weather turns to strong sunlight in the meantime.","short_effect_description":"Protects against major status ailments during strong sunlight.","pokemon":["tangela","chikorita","bayleef","meganium","hoppip","skiploom","jumpluff","roselia","budew","tangrowth","leafeon","swadloon","petilil","lilligant","fomantis","lurantis","bounsweet","steenee","tsareena","zarude","lurantis-totem"]},"klutz":{"name":"klutz","description":"The Pokémon can’t use any held items.","effect_description":"In battle, this Pokémon cannot use its held item, nor will the item have any passive effect on the battle, positive or negative.  This Pokémon also cannot use fling.  The Speed cut from the iron ball and the effort items (the macho brace, power weight, power bracer, power belt, power lens, power band, and power anklet) is unaffected.  Items that do not directly affect the battle, such as the exp share, the amulet coin, or the soothe bell, work as usual.  All held items work as usual out of battle.  Other moves that use the held item, such as natural gift and switcheroo, work as usual.","short_effect_description":"Prevents the Pokémon from using its held item in battle.","pokemon":["buneary","lopunny","woobat","swoobat","audino","golett","golurk","stufful","bewear","toxel"]},"mold-breaker":{"name":"mold-breaker","description":"Moves can be used on the target regardless of its Abilities.","effect_description":"This Pokémon's moves completely ignore abilities that could hinder or prevent their effect on the target.  For example, this Pokémon's moves ignore abilities that would fully negate them, such as water absorb; abilities that would prevent any of their effects, such as clear body, shell armor, or sticky hold; and abilities that grant any general protective benefit, such as simple, snow cloak, or thick fat.  If an ability could either hinder or help this Pokémon's moves, e.g. dry skin or unaware, the ability is ignored either way.  Abilities that do not fit this description, even if they could hinder moves in some other way, are not affected.  For example, cursed body only affects potential future uses of the move, while liquid ooze and shadow tag can only hinder a move's effect on the user.  This ablity cannot ignore type or form changes granted by abilities, for example color change or forecast; nor effects that were caused by abilities but are no longer tied to an ability, such as the rain from drizzle.  This ability cannot ignore multitype at all.  An ability ignored by this ability is only nullified while the move is being used.  For example, this Pokémon's moves can paralyze a Pokémon with limber, but Limber will activate and heal the paralysis immediately thereafter, and this Pokémon's spikes are not affected by this ability after they have been placed.  When this Pokémon enters battle, all participating trainers are notified that it has this ability.  This ability functions identically to teravolt and turboblaze.","short_effect_description":"Bypasses targets' abilities if they could hinder or prevent a move.","pokemon":["pinsir","cranidos","rampardos","drilbur","excadrill","throh","sawk","basculin-red-striped","axew","fraxure","haxorus","druddigon","pancham","pangoro","hawlucha","basculin-blue-striped","gyarados-mega","ampharos-mega"]},"super-luck":{"name":"super-luck","description":"Boosts the critical-hit ratios of moves.","effect_description":"This Pokémon's moves have critical hit rates one stage higher than normal.","short_effect_description":"Raises moves' critical hit rates one stage.","pokemon":["togepi","togetic","murkrow","absol","honchkrow","togekiss","pidove","tranquill","unfezant"]},"aftermath":{"name":"aftermath","description":"Damages the attacker landing the finishing hit.","effect_description":"When this Pokémon is knocked out by a move that makes contact, the move's user takes 1/4 its maximum HP in damage.","short_effect_description":"Damages the attacker for 1/4 its max HP when knocked out by a contact move.","pokemon":["voltorb","electrode","drifloon","drifblim","stunky","skuntank","trubbish","garbodor","garbodor-gmax"]},"anticipation":{"name":"anticipation","description":"Senses an opposing Pokémon’s dangerous moves.","effect_description":"When this Pokémon enters battle, if one of its opponents has a move that is super effective against it, self destruct, explosion, or a one-hit knockout move, all participating trainers are notified.  The move itself is not revealed; only that there is such a move.  Moves that inflict typeless damage, such as future sight, and moves of variable type, such as hidden power, count as their listed types.  counter, metal burst, mirror coat, and one-hit KO moves to which this Pokémon is immune do not trigger this ability.","short_effect_description":"Notifies all trainers upon entering battle if an opponent has a super-effective move, self destruct, explosion, or a one-hit KO move.","pokemon":["eevee","barboach","whiscash","wormadam-plant","croagunk","toxicroak","ferrothorn","hatenna","hattrem","hatterene","wormadam-sandy","wormadam-trash","ponyta-galar","rapidash-galar","eevee-gmax","hatterene-gmax"]},"forewarn":{"name":"forewarn","description":"Determines what moves an opposing Pokémon has.","effect_description":"When this Pokémon enters battle, it reveals the move with the highest base power known by any opposing Pokémon to all participating trainers.  In the event of a tie, one is chosen at random.  Moves without a listed base power are assigned one as follows:  Power | Moves ----: | -----   160 | One-hit KO moves: fissure, guillotine, horn drill, and sheer cold   120 | Counter moves: counter, metal burst, and mirror coat    80 | Variable power or set damage: crush grip, dragon rage, electro ball, endeavor, final gambit, flail, frustration, grass knot, gyro ball, heat crash, heavy slam, hidden power, low kick, natural gift, night shade, psywave, return, reversal, seismic toss, sonic boom, trump card, and wring out     0 | Any such move not listed ","short_effect_description":"Reveals the opponents' strongest move upon entering battle.","pokemon":["drowzee","hypno","jynx","smoochum","munna","musharna"]},"unaware":{"name":"unaware","description":"Ignores the opposing Pokémon’s stat changes.","effect_description":"This Pokémon ignores other Pokémon's stat modifiers for the purposes of damage and accuracy calculation.  Effectively, this affects modifiers of every stat except Speed.  The power of punishment and stored power is calculated as usual.  When this Pokémon hurts itself in confusion, its stat modifiers affect damage as usual.","short_effect_description":"Ignores other Pokémon's stat modifiers for damage and accuracy calculation.","pokemon":["clefable","wooper","quagsire","bidoof","bibarel","woobat","swoobat","pyukumuku","cosmog"]},"tinted-lens":{"name":"tinted-lens","description":"Powers up “not very effective” moves.","effect_description":"This Pokémon deals twice as much damage with moves that are not very effective against the target.","short_effect_description":"Doubles damage inflicted with not-very-effective moves.","pokemon":["butterfree","venonat","venomoth","hoothoot","noctowl","illumise","mothim","yanmega","sigilyph","butterfree-gmax"]},"filter":{"name":"filter","description":"Reduces damage from supereffective attacks.","effect_description":"This Pokémon takes 0.75× as much damage from moves that are super effective against it.  This ability functions identically to solid rock.","short_effect_description":"Decreases damage taken from super-effective moves by 1/4.","pokemon":["mr-mime","mime-jr","aggron-mega"]},"slow-start":{"name":"slow-start","description":"Temporarily halves the Pokémon’s Attack and Speed stats.","effect_description":"This Pokémon's Attack and Speed are halved for five turns upon entering battle.  This ability also takes effect when acquired during battle.  If this Pokémon loses its ability before the five turns are up, its Attack and Speed return to normal; if it then regains this ability without leaving battle, its Attack and Speed are halved again, but the counter keeps counting from where it was.","short_effect_description":"Halves Attack and Speed for five turns upon entering battle.","pokemon":["regigigas"]},"scrappy":{"name":"scrappy","description":"Makes Normal- and Fighting-type moves hit Ghost-type Pokémon.","effect_description":"This Pokémon ignores ghost-type Pokémon's immunity to normal- and fighting-type moves.  Ghost Pokémon's other types affect damage as usual.","short_effect_description":"Lets the Pokémon's normal and fighting moves hit ghost Pokémon.","pokemon":["kangaskhan","miltank","taillow","swellow","loudred","exploud","herdier","stoutland","pancham","pangoro","sirfetchd","lopunny-mega","farfetchd-galar"]},"storm-drain":{"name":"storm-drain","description":"Draws in all Water-type moves to boost its Sp. Atk stat.","effect_description":"All other Pokémon's single-target water-type moves are redirected to this Pokémon, if it is an eligible target.  Other Pokémon's Water moves raise this Pokémon's Special Attack one stage, negating any other effect on it, and cannot miss it.  If the move's intended target also has this ability, the move is not redirected.  When multiple Pokémon with this ability are possible targets for redirection, the move is redirected to the one with the highest Speed stat, or, in the case of a tie, to a random tied Pokémon.  follow me takes precedence over this ability.","short_effect_description":"Redirects single-target water moves to this Pokémon where possible.  Absorbs Water moves, raising Special Attack one stage.","pokemon":["lileep","cradily","shellos","gastrodon","finneon","lumineon","maractus"]},"ice-body":{"name":"ice-body","description":"The Pokémon gradually regains HP in a hailstorm.","effect_description":"This Pokémon heals for 1/16 of its maximum HP after each turn during hail, and it does not take hail damage regardless of type.","short_effect_description":"Heals for 1/16 max HP after each turn during hail.  Protects against hail damage.","pokemon":["seel","dewgong","snorunt","glalie","spheal","sealeo","walrein","regice","glaceon","vanillite","vanillish","vanilluxe","bergmite","avalugg","mr-rime","arctovish","mr-mime-galar"]},"solid-rock":{"name":"solid-rock","description":"Reduces damage from supereffective attacks.","effect_description":"This Pokémon takes 0.75× as much damage from moves that are super effective against it.  This ability functions identically to filter.","short_effect_description":"Decreases damage taken from super-effective moves by 1/4.","pokemon":["camerupt","rhyperior","tirtouga","carracosta"]},"snow-warning":{"name":"snow-warning","description":"The Pokémon summons a hailstorm when it enters a battle.","effect_description":"The weather changes to hail when this Pokémon enters battle and does not end unless cancelled by another weather condition.  If multiple Pokémon with this ability, drizzle, drought, or sand stream are sent out at the same time, the abilities will activate in order of Speed, respecting trick room.  Each ability's weather will cancel the previous weather, and only the weather summoned by the slowest of the Pokémon will stay.","short_effect_description":"Summons hail that lasts indefinitely upon entering battle.","pokemon":["snover","abomasnow","vanilluxe","amaura","aurorus","abomasnow-mega","vulpix-alola","ninetales-alola"]},"honey-gather":{"name":"honey-gather","description":"The Pokémon may gather Honey from somewhere.","effect_description":"This Pokémon has a chance of picking up honey after each battle.  This chance starts at 5% and rises another 5% after every tenth level: 5% from level 1–10, 10% from 11–20, and so on, up to 50% from 91–100.  This ability is checked after the battle ends, at which point any temporary ability changes have worn off.","short_effect_description":"The Pokémon may pick up honey after battle.","pokemon":["teddiursa","combee","cutiefly","ribombee","ribombee-totem"]},"frisk":{"name":"frisk","description":"The Pokémon can check an opposing Pokémon’s held item.","effect_description":"When this Pokémon enters battle, it reveals an opposing Pokémon's held item to all participating trainers.  In a double battle, if one opponent has an item, this Pokémon will Frisk that Pokémon; if both have an item, it will Frisk one at random.","short_effect_description":"Reveals an opponent's held item upon entering battle.","pokemon":["wigglytuff","sentret","furret","yanma","stantler","shuppet","banette","duskull","dusclops","yanmega","dusknoir","gothita","gothorita","gothitelle","phantump","trevenant","pumpkaboo-average","gourgeist-average","noibat","noivern","orbeetle","impidimp","morgrem","grimmsnarl","pumpkaboo-small","pumpkaboo-large","pumpkaboo-super","gourgeist-small","gourgeist-large","gourgeist-super","exeggutor-alola","orbeetle-gmax","grimmsnarl-gmax"]},"reckless":{"name":"reckless","description":"Powers up moves that have recoil damage.","effect_description":"This Pokémon's recoil moves and crash moves have 1.2× their base power.  struggle is unaffected.  The \"crash moves\" are the moves that damage the user upon missing: jump kick and high jump kick.","short_effect_description":"Strengthens recoil moves to 1.2× their power.","pokemon":["hitmonlee","rhyhorn","rhydon","starly","staravia","staraptor","rhyperior","emboar","basculin-red-striped","mienfoo","mienshao","bouffalant","obstagoon"]},"multitype":{"name":"multitype","description":"Changes the Pokémon’s type to match the Plate it holds.","effect_description":"If this Pokémon is holding an elemental Plate, its type and form change to match the Plate.  This Pokémon's held item, whether or not it is a Plate, cannot be taken by covet or thief, nor removed by knock off, nor traded by switcheroo or trick.  Covet, Thief, and Knock Off still inflict damage against this Pokémon.  Unlike with sticky hold, this Pokémon cannot use fling, Switcheroo, or Trick to lose its item itself, nor gain an item through Switcheroo or Trick if it does not have one.  This ability has no effect for any Pokémon other than arceus.  This ability cannot be traded with skill swap, nor copied with role play or trace, nor disabled with gastro acid, nor changed with worry seed.  This Pokémon cannot use Skill Swap or Role Play to lose its ability itself.  mold breaker cannot ignore this ability.  If a Pokémon Transforms into an Arceus with this ability, it will Transform into Arceus's default, normal-type form.  If the Transforming Pokémon is holding a Plate, this ability will then activate and change the Pokémon into the corresponding form.","short_effect_description":"Changes arceus's type and form to match its held Plate.","pokemon":["arceus"]},"flower-gift":{"name":"flower-gift","description":"Powers up party Pokémon when it is sunny.","effect_description":"Friendly Pokémon have 1.5× their Attack and Special Defense during strong sunlight if any friendly Pokémon has this ability.  Unlike forecast, multitype, and zen mode, this ability is not tied to its Pokémon's form change; cherrim will switch between its forms even if it loses this ability.  As such, this ability also works if obtained by a Pokémon other than Cherrim.","short_effect_description":"Increases friendly Pokémon's Attack and Special Defense to 1.5× during strong sunlight.","pokemon":["cherrim"]},"bad-dreams":{"name":"bad-dreams","description":"Reduces the HP of sleeping opposing Pokémon.","effect_description":"Opposing Pokémon take 1/8 of their maximum HP in damage after each turn while they are asleep.","short_effect_description":"Damages sleeping opponents for 1/8 their max HP after each turn.","pokemon":["darkrai"]},"pickpocket":{"name":"pickpocket","description":"Steals an item from an attacker that made direct contact.","effect_description":"Whenever a move makes contact with this Pokémon, if it does not have a held item, it steals the attacker's held item.  This Pokémon cannot steal upon being knocked out.  It can steal if the attacker has a substitute, but cannot steal when its own Substitute is hit.  If a move hits multiple times, only the last hit triggers this ability.  If this Pokémon is wild, it cannot steal from a trained Pokémon.","short_effect_description":"Steals attacking Pokémon's held items on contact.","pokemon":["sneasel","seedot","nuzleaf","shiftry","weavile","binacle","barbaracle","impidimp","morgrem","grimmsnarl","grimmsnarl-gmax"]},"sheer-force":{"name":"sheer-force","description":"Removes additional effects to increase move damage.","effect_description":"This Pokémon's moves with extra effects have 1.3× their power, but lose their extra effects.  An effect chance is a move's chance to inflict a status ailment, cause a stat change, or make the target flinch in addition to the move's main effect. For example, thunder shock's paralysis is an extra effect, but thunder wave's is not, nor are knock off's item removal and air cutter's increased critical hit rate.  Moves that lower the user's stats are unaffected.","short_effect_description":"Strengthens moves with extra effects to 1.3× their power, but prevents their extra effects.","pokemon":["nidoqueen","nidoking","krabby","kingler","tauros","totodile","croconaw","feraligatr","steelix","makuhita","hariyama","mawile","trapinch","bagon","cranidos","rampardos","timburr","gurdurr","conkeldurr","darmanitan-standard","druddigon","rufflet","braviary","landorus-incarnate","toucannon","cufant","copperajah","darmanitan-zen","camerupt-mega","kingler-gmax","copperajah-gmax"]},"contrary":{"name":"contrary","description":"Makes stat changes have an opposite effect.","effect_description":"Whenever this Pokémon's stats would be raised, they are instead lowered by the same amount, and vice versa.","short_effect_description":"Inverts stat changes.","pokemon":["shuckle","spinda","snivy","servine","serperior","inkay","malamar","fomantis","lurantis","lurantis-totem"]},"unnerve":{"name":"unnerve","description":"Unnerves opposing Pokémon and makes them unable to eat Berries.","effect_description":"Opposing Pokémon cannot eat held Berries while this Pokémon is in battle.  Affected Pokémon can still use bug bite or pluck to eat a target's Berry.","short_effect_description":"Prevents opposing Pokémon from eating held Berries.","pokemon":["ekans","arbok","meowth","persian","aerodactyl","mewtwo","ursaring","houndour","houndoom","tyranitar","masquerain","vespiquen","joltik","galvantula","axew","fraxure","haxorus","litleo","pyroar","bewear","rookidee","corvisquire","corviknight","calyrex","meowth-galar","meowth-gmax","corviknight-gmax"]},"defiant":{"name":"defiant","description":"Boosts the Pokémon’s Attack stat when its stats are lowered.","effect_description":"When any of this Pokémon's stats are lowered, its Attack rises by two stages.  If multiple stats are lowered at once, this ability takes effect with each stat lowered.","short_effect_description":"Raises Attack two stages upon having any stat lowered.","pokemon":["mankey","primeape","farfetchd","piplup","prinplup","empoleon","purugly","pawniard","bisharp","braviary","tornadus-incarnate","thundurus-incarnate","passimian","obstagoon","falinks","zapdos-galar"]},"defeatist":{"name":"defeatist","description":"Lowers stats when HP becomes half or less.","effect_description":"This Pokémon's Attack and Special Attack are halved when it has half its HP or less.","short_effect_description":"Halves Attack and Special Attack at 50% max HP or less.","pokemon":["archen","archeops"]},"cursed-body":{"name":"cursed-body","description":"May disable a move used on the Pokémon.","effect_description":"Moves that hit this Pokémon have a 30% chance of being Disabled afterward.","short_effect_description":"Has a 30% chance of Disabling any move that hits the Pokémon.","pokemon":["gengar","shuppet","banette","froslass","frillish","jellicent","sinistea","polteageist","dreepy","drakloak","dragapult","marowak-alola","marowak-totem","corsola-galar","gengar-gmax"]},"healer":{"name":"healer","description":"Sometimes heals an ally’s status condition.","effect_description":"Friendly Pokémon next to this Pokémon in double and triple battles each have a 30% chance of being cured of any major status ailment after each turn.","short_effect_description":"Has a 30% chance of curing each adjacent ally of any major status ailment after each turn.","pokemon":["chansey","bellossom","blissey","audino","alomomola","spritzee","aromatisse","hatenna","hattrem","hatterene","audino-mega","hatterene-gmax"]},"friend-guard":{"name":"friend-guard","description":"Reduces damage done to allies.","effect_description":"All friendly Pokémon take 0.75× as much direct damage from moves while this Pokémon is in battle.  This effect stacks if multiple allied Pokémon have it.","short_effect_description":"Decreases all direct damage taken by friendly Pokémon to 0.75×.","pokemon":["clefairy","jigglypuff","cleffa","igglybuff","happiny","scatterbug","spewpa","vivillon"]},"weak-armor":{"name":"weak-armor","description":"Physical attacks lower its Defense stat and raise its Speed stat.","effect_description":"Whenever a physical move hits this Pokémon, its Speed rises one stage and its Defense falls one stage.  This ability triggers on every hit of a multiple-hit move.","short_effect_description":"Raises Speed and lowers Defense by one stage each upon being hit by a physical move.","pokemon":["onix","omanyte","omastar","kabuto","kabutops","slugma","magcargo","skarmory","roggenrola","boldore","dwebble","crustle","garbodor","vanillite","vanillish","vanilluxe","vullaby","mandibuzz","sinistea","polteageist","cursola","corsola-galar","garbodor-gmax"]},"heavy-metal":{"name":"heavy-metal","description":"Doubles the Pokémon’s weight.","effect_description":"This Pokémon has double the usual weight for its species.","short_effect_description":"Doubles the Pokémon's weight.","pokemon":["aron","lairon","aggron","bronzor","bronzong","cufant","copperajah","duraludon","copperajah-gmax","duraludon-gmax"]},"light-metal":{"name":"light-metal","description":"Halves the Pokémon’s weight.","effect_description":"This Pokémon has half the usual weight for its species.","short_effect_description":"Halves the Pokémon's weight.","pokemon":["scizor","beldum","metang","metagross","registeel","duraludon","duraludon-gmax"]},"multiscale":{"name":"multiscale","description":"Reduces damage the Pokémon takes when its HP is full.","effect_description":"This Pokémon takes half as much damage when it is hit having full HP.","short_effect_description":"Halves damage taken from full HP.","pokemon":["dragonite","lugia"]},"toxic-boost":{"name":"toxic-boost","description":"Powers up physical attacks when the Pokémon is poisoned.","effect_description":"This Pokémon has 1.5× its Attack when poisoned.","short_effect_description":"Increases Attack to 1.5× when poisoned.","pokemon":["zangoose"]},"flare-boost":{"name":"flare-boost","description":"Powers up special attacks when the Pokémon is burned.","effect_description":"This Pokémon has 1.5× its Special Attack when burned.","short_effect_description":"Increases Special Attack to 1.5× when burned.","pokemon":["drifloon","drifblim"]},"harvest":{"name":"harvest","description":"May create another Berry after one is used.","effect_description":"After each turn, if the last item this Pokémon consumed was a Berry and it is not currently holding an item, it has a 50% chance of regaining that Berry, or a 100% chance during strong sunlight.","short_effect_description":"Has a 50% chance of restoring a used Berry after each turn if the Pokémon has held no items in the meantime.","pokemon":["exeggcute","exeggutor","tropius","phantump","trevenant","exeggutor-alola"]},"telepathy":{"name":"telepathy","description":"Anticipates an ally’s attack and dodges it.","effect_description":"This Pokémon does not take damage from friendly Pokémon's moves, including single-target moves aimed at it.","short_effect_description":"Protects against friendly Pokémon's damaging moves.","pokemon":["wobbuffet","ralts","kirlia","gardevoir","meditite","medicham","wynaut","dialga","palkia","giratina-altered","munna","musharna","elgyem","beheeyem","noibat","noivern","oranguru","tapu-koko","tapu-lele","tapu-bulu","tapu-fini","blipbug","dottler","orbeetle","orbeetle-gmax"]},"moody":{"name":"moody","description":"Raises one stat and lowers another.","effect_description":"After each turn, one of this Pokémon's stats at random rises two stages, and another falls one stage.  If a stat is already at 6 or -6 stages, it will not be chosen to be increased or decreased, respectively.","short_effect_description":"Raises a random stat two stages and lowers another one stage after each turn.","pokemon":["remoraid","octillery","smeargle","snorunt","glalie","bidoof","bibarel"]},"overcoat":{"name":"overcoat","description":"Protects the Pokémon from things like sand, hail, and powder.","effect_description":"This Pokémon does not take damage from weather.","short_effect_description":"Protects against damage from weather.","pokemon":["shellder","cloyster","pineco","forretress","shelgon","burmy","wormadam-plant","sewaddle","swadloon","leavanny","solosis","duosion","reuniclus","escavalier","shelmet","vullaby","mandibuzz","jangmo-o","hakamo-o","kommo-o","wormadam-sandy","wormadam-trash","kommo-o-totem"]},"poison-touch":{"name":"poison-touch","description":"May poison a target when the Pokémon makes contact.","effect_description":"This Pokémon's contact moves have a 30% chance of poisoning the target with each hit.  This counts as an extra effect for the purposes of shield dust.  This ability takes effect before mummy.","short_effect_description":"Has a 30% chance of poisoning target Pokémon upon contact.","pokemon":["grimer","muk","croagunk","toxicroak","seismitoad","skrelp","dragalge","grimer-alola","muk-alola"]},"regenerator":{"name":"regenerator","description":"Restores a little HP when withdrawn from battle.","effect_description":"This Pokémon regains 1/3 of its maximum HP when it is switched out for another Pokémon under any circumstances other than having fainted.  This ability does not take effect when a battle ends.","short_effect_description":"Heals for 1/3 max HP upon switching out.","pokemon":["slowpoke","slowbro","tangela","slowking","corsola","ho-oh","tangrowth","audino","solosis","duosion","reuniclus","foongus","amoonguss","alomomola","mienfoo","mienshao","mareanie","toxapex","gossifleur","eldegoss","tornadus-therian","slowpoke-galar","slowbro-galar","slowking-galar"]},"big-pecks":{"name":"big-pecks","description":"Protects the Pokémon from Defense-lowering attacks.","effect_description":"This Pokémon's Defense cannot be lowered by other Pokémon.  This Pokémon can still be passed negative Defense modifiers through heart swap or guard swap.","short_effect_description":"Protects against Defense drops.","pokemon":["pidgey","pidgeotto","pidgeot","chatot","pidove","tranquill","unfezant","ducklett","swanna","vullaby","mandibuzz","fletchling","rookidee","corvisquire"]},"sand-rush":{"name":"sand-rush","description":"Boosts the Pokémon’s Speed stat in a sandstorm.","effect_description":"This Pokémon's Speed is doubled during a sandstorm, and it does not take sandstorm damage, regardless of type.","short_effect_description":"Doubles Speed during a sandstorm.  Protects against sandstorm damage.","pokemon":["sandshrew","sandslash","herdier","stoutland","drilbur","excadrill","lycanroc-midday","dracozolt","dracovish"]},"wonder-skin":{"name":"wonder-skin","description":"Makes status moves more likely to miss.","effect_description":"Non-damaging moves have exactly 50% base accuracy against this Pokémon.","short_effect_description":"Lowers incoming non-damaging moves' base accuracy to exactly 50%.","pokemon":["venomoth","skitty","delcatty","sigilyph","bruxish"]},"analytic":{"name":"analytic","description":"Boosts move power when the Pokémon moves after the target.","effect_description":"This Pokémon's moves have 1.3× their power when it moves last in a turn.  future sight and doom desire are unaffected.","short_effect_description":"Strengthens moves to 1.3× their power when moving last.","pokemon":["magnemite","magneton","staryu","starmie","porygon","porygon2","magnezone","porygon-z","patrat","watchog","elgyem","beheeyem"]},"illusion":{"name":"illusion","description":"Comes out disguised as the Pokémon in the party’s last spot.","effect_description":"This Pokémon, upon being sent out, appears to have the species, nickname, and Poké Ball of the last Pokémon in the party that is able to battle.  This illusion breaks upon being hit by a damaging move.  Other damage, e.g. from weather or spikes, does not break the illusion, nor does damage done to a substitute.  If the party order becomes temporarily shuffled around as Pokémon are switched out in battle, this ability chooses the last Pokémon according to that shuffled order.","short_effect_description":"Takes the appearance of the last conscious party Pokémon upon being sent out until hit by a damaging move.","pokemon":["zorua","zoroark"]},"imposter":{"name":"imposter","description":"The Pokémon transforms itself into the Pokémon it’s facing.","effect_description":"This Pokémon transforms into a random opponent upon entering battle.  This effect is identical to the move transform.","short_effect_description":"Transforms upon entering battle.","pokemon":["ditto"]},"infiltrator":{"name":"infiltrator","description":"Passes through the opposing Pokémon’s barrier and strikes.","effect_description":"This Pokémon's moves ignore light screen, reflect, and safeguard.","short_effect_description":"Bypasses light screen, reflect, and safeguard.","pokemon":["zubat","golbat","crobat","hoppip","skiploom","jumpluff","ninjask","seviper","spiritomb","cottonee","whimsicott","litwick","lampent","chandelure","espurr","meowstic-male","inkay","malamar","noibat","noivern","dreepy","drakloak","dragapult","meowstic-female"]},"mummy":{"name":"mummy","description":"Contact with the Pokémon spreads this Ability.","effect_description":"Whenever a contact move hits this Pokémon, the attacking Pokémon's ability changes to Mummy.  multitype is unaffected.  If a Pokémon with moxie knocks this Pokémon out, the former's ability will change without taking effect.","short_effect_description":"Changes attacking Pokémon's abilities to Mummy on contact.","pokemon":["yamask","cofagrigus"]},"moxie":{"name":"moxie","description":"Boosts the Attack stat after knocking out any Pokémon.","effect_description":"This Pokémon's Attack rises one stage upon knocking out another Pokémon, even a friendly Pokémon.  This ability does not take effect when the Pokémon indirectly causes another Pokémon to faint, e.g. through poison or spikes.  If this Pokémon knocks out a Pokémon with mummy, the former's ability will change without taking effect.","short_effect_description":"Raises Attack one stage upon KOing a Pokémon.","pokemon":["pinsir","gyarados","heracross","mightyena","salamence","honchkrow","sandile","krokorok","krookodile","scraggy","scrafty","litleo","pyroar"]},"justified":{"name":"justified","description":"Boosts the Attack stat when it’s hit by a Dark-type move.","effect_description":"Whenever a dark-type move hits this Pokémon, its Attack rises one stage.  The move is not negated in any way.","short_effect_description":"Raises Attack one stage upon taking damage from a dark move.","pokemon":["growlithe","arcanine","absol","lucario","gallade","cobalion","terrakion","virizion","keldeo-ordinary","keldeo-resolute"]},"rattled":{"name":"rattled","description":"Some move types scare it and boost its Speed stat.","effect_description":"This Pokémon's Speed rises one stage with each hit from a damaging dark-, ghost-, or bug-type move.","short_effect_description":"Raises Speed one stage upon being hit by a dark, ghost, or bug move.","pokemon":["magikarp","ledyba","sudowoodo","dunsparce","snubbull","granbull","poochyena","whismur","clamperl","bonsly","cubchoo","yamper","toxel","meowth-alola","persian-alola"]},"magic-bounce":{"name":"magic-bounce","description":"Reflects status moves.","effect_description":"When this Pokémon is targeted by a move flagged as being reflectable, the move is redirected to its user.  All reflectable moves are non-damaging, and most non-damaging moves that target other Pokémon are reflectable.  A move reflected by this ability or magic coat cannot be reflected back.","short_effect_description":"Reflects most non-damaging moves back at their user.","pokemon":["natu","xatu","espeon","hatenna","hattrem","hatterene","absol-mega","sableye-mega","diancie-mega","hatterene-gmax"]},"sap-sipper":{"name":"sap-sipper","description":"Boosts the Attack stat when hit by a Grass-type move.","effect_description":"Whenever a grass-type move hits this Pokémon, its Attack rises one stage, negating any other effect on it.","short_effect_description":"Absorbs grass moves, raising Attack one stage.","pokemon":["marill","azumarill","girafarig","stantler","miltank","azurill","blitzle","zebstrika","deerling","sawsbuck","bouffalant","skiddo","gogoat","goomy","sliggoo","goodra","drampa"]},"prankster":{"name":"prankster","description":"Gives priority to a status move.","effect_description":"This Pokémon's non-damaging moves have their priority increased by one stage.","short_effect_description":"Raises non-damaging moves' priority by one stage.","pokemon":["murkrow","sableye","volbeat","illumise","riolu","purrloin","liepard","cottonee","whimsicott","tornadus-incarnate","thundurus-incarnate","meowstic-male","klefki","impidimp","morgrem","grimmsnarl","banette-mega","grimmsnarl-gmax"]},"sand-force":{"name":"sand-force","description":"Boosts certain moves’ power in a sandstorm.","effect_description":"During a sandstorm, this Pokémon's rock-, ground-, and steel-type moves have 1.3× their base power.  This Pokémon does not take sandstorm damage, regardless of type.","short_effect_description":"Strengthens rock, ground, and steel moves to 1.3× their power during a sandstorm.  Protects against sandstorm damage.","pokemon":["diglett","dugtrio","nosepass","shellos","gastrodon","hippopotas","hippowdon","probopass","roggenrola","boldore","gigalith","drilbur","excadrill","landorus-incarnate","garchomp-mega","steelix-mega","diglett-alola","dugtrio-alola"]},"iron-barbs":{"name":"iron-barbs","description":"Inflicts damage to the attacker on contact.","effect_description":"Whenever a move makes contact with this Pokémon, the move's user takes 1/8 of its maximum HP in damage.  This ability functions identically to rough skin.","short_effect_description":"Damages attacking Pokémon for 1/8 their max HP on contact.","pokemon":["ferroseed","ferrothorn","togedemaru","togedemaru-totem"]},"zen-mode":{"name":"zen-mode","description":"Changes the Pokémon’s shape when HP is half or less.","effect_description":"This Pokémon switches between Standard Mode and Zen Mode after each turn depending on its HP.  Below 50% of its maximum HP, it switches to Zen Mode, and at 50% or above, it switches to Standard Mode.  This Pokémon returns to Standard Mode upon leaving battle or losing this ability.  This ability has no effect if this Pokémon is not a darmanitan.","short_effect_description":"Changes darmanitan's form after each turn depending on its HP: Zen Mode below 50% max HP, and Standard Mode otherwise.","pokemon":["darmanitan-standard","darmanitan-zen","darmanitan-standard-galar","darmanitan-zen-galar"]},"victory-star":{"name":"victory-star","description":"Boosts the accuracy of its allies and itself.","effect_description":"All friendly Pokémon's moves, including this Pokémon's own moves, have 1.1× their usual accuracy while this Pokémon is in battle.","short_effect_description":"Increases moves' accuracy to 1.1× for friendly Pokémon.","pokemon":["victini"]},"turboblaze":{"name":"turboblaze","description":"Moves can be used on the target regardless of its Abilities.","effect_description":"This Pokémon's moves completely ignore abilities that could hinder or prevent their effect on the target.  For example, this Pokémon's moves ignore abilities that would fully negate them, such as water absorb; abilities that would prevent any of their effects, such as clear body, shell armor, or sticky hold; and abilities that grant any general protective benefit, such as simple, snow cloak, or thick fat.  If an ability could either hinder or help this Pokémon's moves, e.g. dry skin or unaware, the ability is ignored either way.  Abilities that do not fit this description, even if they could hinder moves in some other way, are not affected.  For example, cursed body only affects potential future uses of the move, while liquid ooze and shadow tag can only hinder a move's effect on the user.  This ablity cannot ignore type or form changes granted by abilities, for example color change or forecast; nor effects that were caused by abilities but are no longer tied to an ability, such as the rain from drizzle.  This ability cannot ignore multitype at all.  An ability ignored by this ability is only nullified while the move is being used.  For example, this Pokémon's moves can paralyze a Pokémon with limber, but Limber will activate and heal the paralysis immediately thereafter, and this Pokémon's spikes are not affected by this ability after they have been placed.  When this Pokémon enters battle, all participating trainers are notified that it has this ability.  This ability functions identically to mold breaker and teravolt.","short_effect_description":"Bypasses targets' abilities if they could hinder or prevent moves.","pokemon":["reshiram","kyurem-white"]},"teravolt":{"name":"teravolt","description":"Moves can be used on the target regardless of its Abilities.","effect_description":"This Pokémon's moves completely ignore abilities that could hinder or prevent their effect on the target.  For example, this Pokémon's moves ignore abilities that would fully negate them, such as water absorb; abilities that would prevent any of their effects, such as clear body, shell armor, or sticky hold; and abilities that grant any general protective benefit, such as simple, snow cloak, or thick fat.  If an ability could either hinder or help this Pokémon's moves, e.g. dry skin or unaware, the ability is ignored either way.  Abilities that do not fit this description, even if they could hinder moves in some other way, are not affected.  For example, cursed body only affects potential future uses of the move, while liquid ooze and shadow tag can only hinder a move's effect on the user.  This ablity cannot ignore type or form changes granted by abilities, for example color change or forecast; nor effects that were caused by abilities but are no longer tied to an ability, such as the rain from drizzle.  This ability cannot ignore multitype at all.  An ability ignored by this ability is only nullified while the move is being used.  For example, this Pokémon's moves can paralyze a Pokémon with limber, but Limber will activate and heal the paralysis immediately thereafter, and this Pokémon's spikes are not affected by this ability after they have been placed.  When this Pokémon enters battle, all participating trainers are notified that it has this ability.  This ability functions identically to mold breaker and turboblaze.","short_effect_description":"Bypasses targets' abilities if they could hinder or prevent moves.","pokemon":["zekrom","kyurem-black"]},"aroma-veil":{"name":"aroma-veil","description":"Protects allies from attacks that limit their move choices.","effect_description":"Protects allies against moves that affect their mental state.","short_effect_description":"Protects allies against moves that affect their mental state.","pokemon":["spritzee","aromatisse","milcery","alcremie","alcremie-gmax"]},"flower-veil":{"name":"flower-veil","description":"Prevents lowering of ally Grass-type Pokémon’s stats.","effect_description":"Protects friendly grass Pokémon from having their stats lowered by other Pokémon.","short_effect_description":"Protects friendly grass Pokémon from having their stats lowered by other Pokémon.","pokemon":["flabebe","floette","florges","comfey","floette-eternal"]},"cheek-pouch":{"name":"cheek-pouch","description":"Restores HP as well when the Pokémon eats a Berry.","effect_description":"Restores HP upon eating a Berry, in addition to the Berry's effect.","short_effect_description":"Restores HP upon eating a Berry, in addition to the Berry's effect.","pokemon":["bunnelby","diggersby","dedenne","skwovet","greedent"]},"protean":{"name":"protean","description":"Changes the Pokémon’s type to the type of the move it’s using.","effect_description":"Changes the bearer's type to match each move it uses.  The type change takes place just before the move is used.","short_effect_description":"Changes the bearer's type to match each move it uses.","pokemon":["kecleon","froakie","frogadier","greninja"]},"fur-coat":{"name":"fur-coat","description":"Halves damage from physical moves.","effect_description":"Halves damage from physical attacks.","short_effect_description":"Halves damage from physical attacks.","pokemon":["furfrou","persian-alola"]},"magician":{"name":"magician","description":"The Pokémon steals the held item of a Pokémon it hits with a move.","effect_description":"Steals the target's held item when the bearer uses a damaging move.","short_effect_description":"Steals the target's held item when the bearer uses a damaging move.","pokemon":["fennekin","braixen","delphox","klefki","hoopa","hoopa-unbound"]},"bulletproof":{"name":"bulletproof","description":"Protects the Pokémon from some ball and bomb moves.","effect_description":"Protects against bullet, ball, and bomb-based moves.","short_effect_description":"Protects against bullet, ball, and bomb-based moves.","pokemon":["chespin","quilladin","chesnaught","jangmo-o","hakamo-o","kommo-o","wooloo","dubwool","applin","kommo-o-totem"]},"competitive":{"name":"competitive","description":"Boosts the Sp. Atk stat when a stat is lowered.","effect_description":"Raises Special Attack by two stages upon having any stat lowered.","short_effect_description":"Raises Special Attack by two stages upon having any stat lowered.","pokemon":["jigglypuff","wigglytuff","igglybuff","milotic","gothita","gothorita","gothitelle","boltund","meowstic-female","articuno-galar"]},"strong-jaw":{"name":"strong-jaw","description":"The Pokémon’s strong jaw gives it tremendous biting power.","effect_description":"Strengthens biting moves to 1.5× their power.","short_effect_description":"Strengthens biting moves to 1.5× their power.","pokemon":["tyrunt","tyrantrum","yungoos","gumshoos","bruxish","chewtle","drednaw","boltund","dracovish","sharpedo-mega","gumshoos-totem","drednaw-gmax"]},"refrigerate":{"name":"refrigerate","description":"Normal-type moves become Ice-type moves.","effect_description":"Turns the bearer's normal-type moves into ice-type moves.  Moves changed by this ability have 1.3× their power.","short_effect_description":"Turns the bearer's normal moves into ice moves and strengthens them to 1.3× their power.","pokemon":["amaura","aurorus","glalie-mega"]},"sweet-veil":{"name":"sweet-veil","description":"Prevents itself and ally Pokémon from falling asleep.","effect_description":"Prevents friendly Pokémon from sleeping.","short_effect_description":"Prevents friendly Pokémon from sleeping.","pokemon":["swirlix","slurpuff","cutiefly","ribombee","bounsweet","steenee","tsareena","milcery","alcremie","ribombee-totem","alcremie-gmax"]},"stance-change":{"name":"stance-change","description":"The Pokémon changes form depending on how it battles.","effect_description":"Changes aegislash to Blade Forme before using a damaging move, or Shield Forme before using kings shield.","short_effect_description":"Changes aegislash to Blade Forme before using a damaging move, or Shield Forme before using kings shield.","pokemon":["aegislash-shield","aegislash-blade"]},"gale-wings":{"name":"gale-wings","description":"Gives priority to Flying-type moves.","effect_description":"Raises flying moves' priority by one stage.","short_effect_description":"Raises flying moves' priority by one stage.","pokemon":["fletchling","fletchinder","talonflame"]},"mega-launcher":{"name":"mega-launcher","description":"Powers up aura and pulse moves.","effect_description":"Strengthens aura and pulse moves to 1.5× their power.","short_effect_description":"Strengthens aura and pulse moves to 1.5× their power.","pokemon":["clauncher","clawitzer","blastoise-mega"]},"grass-pelt":{"name":"grass-pelt","description":"Boosts the Defense stat in Grassy Terrain.","effect_description":"Boosts Defense while grassy terrain is in effect.","short_effect_description":"Boosts Defense while grassy terrain is in effect.","pokemon":["skiddo","gogoat"]},"symbiosis":{"name":"symbiosis","description":"The Pokémon can pass an item to an ally.","effect_description":"Passes the bearer's held item to an ally when the ally uses up its item.","short_effect_description":"Passes the bearer's held item to an ally when the ally uses up its item.","pokemon":["flabebe","floette","florges","oranguru","floette-eternal"]},"tough-claws":{"name":"tough-claws","description":"Powers up moves that make direct contact.","effect_description":"Strengthens moves that make contact to 1.33× their power.","short_effect_description":"Strengthens moves that make contact to 1.33× their power.","pokemon":["binacle","barbaracle","perrserker","charizard-mega-x","aerodactyl-mega","metagross-mega","lycanroc-dusk","meowth-galar"]},"pixilate":{"name":"pixilate","description":"Normal-type moves become Fairy-type moves.","effect_description":"Turns the bearer's normal-type moves into fairy moves.  Moves changed by this ability have 1.3× their power.","short_effect_description":"Turns the bearer's normal moves into fairy moves and strengthens them to 1.3× their power.","pokemon":["sylveon","gardevoir-mega","altaria-mega"]},"gooey":{"name":"gooey","description":"Contact with the Pokémon lowers the attacker’s Speed stat.","effect_description":"Lowers attacking Pokémon's Speed by one stage on contact.","short_effect_description":"Lowers attacking Pokémon's Speed by one stage on contact.","pokemon":["goomy","sliggoo","goodra"]},"aerilate":{"name":"aerilate","description":"Normal-type moves become Flying-type moves.","effect_description":"Turns the bearer's normal-type moves into flying-type moves.  Moves changed by this ability have 1.3× their power.","short_effect_description":"Turns the bearer's normal moves into flying moves and strengthens them to 1.3× their power.","pokemon":["pinsir-mega","salamence-mega"]},"parental-bond":{"name":"parental-bond","description":"Parent and child attack together.","effect_description":"Lets the bearer hit twice with damaging moves.  The second hit has half power.","short_effect_description":"Lets the bearer hit twice with damaging moves.  The second hit has half power.","pokemon":["kangaskhan-mega"]},"dark-aura":{"name":"dark-aura","description":"Powers up each Pokémon’s Dark-type moves.","effect_description":"Strengthens dark moves for all friendly and opposing Pokémon.","short_effect_description":"Strengthens dark moves to 1.33× their power for all friendly and opposing Pokémon.","pokemon":["yveltal"]},"fairy-aura":{"name":"fairy-aura","description":"Powers up each Pokémon’s Fairy-type moves.","effect_description":"Strengthens fairy moves for all friendly and opposing Pokémon.","short_effect_description":"Strengthens fairy moves to 1.33× their power for all friendly and opposing Pokémon.","pokemon":["xerneas"]},"aura-break":{"name":"aura-break","description":"The effects of “Aura” Abilities are reversed.","effect_description":"While this Pokémon is on the field, dark aura and fairy aura weaken moves of their respective types to 2/3 their power, rather than strengthening them.","short_effect_description":"Makes dark aura and fairy aura weaken moves of their respective types.","pokemon":["zygarde"]},"primordial-sea":{"name":"primordial-sea","description":"Affects weather and nullifies any Fire-type attacks.","effect_description":"When this Pokémon enters battle or gains this ability, the weather becomes heavy rain.  Heavy rain has all the properties of rain dance and also causes damaging Fire moves to fail.  Heavy rain ends when this Pokémon leaves battle or loses this ability, or when this ability is nullified.  The weather cannot otherwise be changed except by the effects of delta stream and desolate land.  air lock and cloud nine will prevent the effects of heavy rain, including allowing Fire moves to work, but will not allow the weather to be changed.","short_effect_description":"Creates heavy rain, which has all the properties of Rain Dance, cannot be replaced, and causes damaging Fire moves to fail.","pokemon":["kyogre-primal"]},"desolate-land":{"name":"desolate-land","description":"Affects weather and nullifies any Water-type attacks.","effect_description":"When this Pokémon enters battle or gains this ability, the weather becomes extremely harsh sunlight.  Extremely harsh sunlight has all the properties of sunny day and also causes damaging Water moves to fail.  Extremely harsh sunlight ends when this Pokémon leaves battle or loses this ability, or when this ability is nullified.  The weather cannot otherwise be changed except by the effects of delta stream and primordial sea.  air lock and cloud nine will prevent the effects of extremely harsh sunlight, including allowing Water moves to work, but will not allow the weather to be changed.","short_effect_description":"Creates extremely harsh sunlight, which has all the properties of Sunny Day, cannot be replaced, and causes damaging Water moves to fail.","pokemon":["groudon-primal"]},"delta-stream":{"name":"delta-stream","description":"Affects weather and eliminates all of the Flying type’s weaknesses.","effect_description":"When this Pokémon enters battle or gains this ability, the weather becomes a mysterious air current.  A mysterious air current causes moves to not be super effective against Flying; they do neutral damage instead.  anticipation and stealth rock are not affected.  The mysterious air current ends when this Pokémon leaves battle or loses this ability, or when this ability is nullified.  The weather cannot otherwise be changed except by the effects of desolate land and primordial sea.  air lock and cloud nine will prevent the effect of a mysterious air current, but will not allow the weather to be changed.","short_effect_description":"Creates a mysterious air current, which cannot be replaced and causes moves to never be super effective against Flying Pokémon.","pokemon":["rayquaza-mega"]},"stamina":{"name":"stamina","description":"Boosts the Defense stat when hit by an attack.","effect_description":"Raises this Pokémon's Defense by one stage when it takes damage from a move.","short_effect_description":"Raises this Pokémon's Defense by one stage when it takes damage from a move.","pokemon":["mudbray","mudsdale"]},"wimp-out":{"name":"wimp-out","description":"The Pokémon cowardly switches out when its HP becomes half or less.","effect_description":"After this Pokémon is hit by a move, if that move caused this Pokémon's HP to drop below half, it switches out.","short_effect_description":"This Pokémon automatically switches out when its HP drops below half.","pokemon":["wimpod"]},"emergency-exit":{"name":"emergency-exit","description":"The Pokémon, sensing danger, switches out when its HP becomes half or less.","effect_description":"After this Pokémon is hit by a move, if that move caused this Pokémon's HP to drop below half, it switches out.","short_effect_description":"This Pokémon automatically switches out when its HP drops below half.","pokemon":["golisopod"]},"water-compaction":{"name":"water-compaction","description":"Boosts the Pokémon’s Defense stat sharply when hit by a Water-type move.","effect_description":"Raises this Pokémon's Defense by two stages when it's hit by a Water move.","short_effect_description":"Raises this Pokémon's Defense by two stages when it's hit by a Water move.","pokemon":["sandygast","palossand"]},"merciless":{"name":"merciless","description":"The Pokémon’s attacks become critical hits if the target is poisoned.","effect_description":"This Pokémon's moves critical hit against poisoned targets.","short_effect_description":"This Pokémon's moves critical hit against poisoned targets.","pokemon":["mareanie","toxapex"]},"shields-down":{"name":"shields-down","description":"When its HP becomes half or less, the Pokémon’s shell breaks and it becomes aggressive.","effect_description":"When this Pokémon enters battle and at the end of each turn, if its HP is 50% or above, it changes into Meteor Form; otherwise, it changes into Core Form.  In Meteor Form, it cannot be given a major status ailment (though existing ones are not cured), cannot become drowsy from yawn, and cannot use rest (which will simply fail).  This ability cannot be copied, replaced, or nullified.  This ability only takes effect for Minior.","short_effect_description":"Transforms this Minior between Core Form and Meteor Form.  Prevents major status ailments and drowsiness while in Meteor Form.","pokemon":["minior-red-meteor","minior-orange-meteor","minior-yellow-meteor","minior-green-meteor","minior-blue-meteor","minior-indigo-meteor","minior-violet-meteor","minior-red","minior-orange","minior-yellow","minior-green","minior-blue","minior-indigo","minior-violet"]},"stakeout":{"name":"stakeout","description":"Doubles the damage dealt to the target’s replacement if the target switches out.","effect_description":"This Pokémon's moves have double power against Pokémon that switched in this turn.","short_effect_description":"This Pokémon's moves have double power against Pokémon that switched in this turn.","pokemon":["yungoos","gumshoos","nickit","thievul","gumshoos-totem"]},"water-bubble":{"name":"water-bubble","description":"Lowers the power of Fire-type moves done to the Pokémon and prevents the Pokémon from getting a burn.","effect_description":"When this Pokémon is hit by a Fire move, the damage is halved.  When this Pokémon uses a Water move, the power is doubled. This Pokémon cannot be burned, and if it becomes burned, the burn is immediately cured.","short_effect_description":"Halves damage from Fire moves, doubles damage of Water moves, and prevents burns.","pokemon":["dewpider","araquanid","araquanid-totem"]},"steelworker":{"name":"steelworker","description":"Powers up Steel-type moves.","effect_description":"This Pokémon's Steel moves have 1.5× power.","short_effect_description":"This Pokémon's Steel moves have 1.5× power.","pokemon":["dhelmise"]},"berserk":{"name":"berserk","description":"Boosts the Pokémon’s Sp. Atk stat when it takes a  hit that causes its HP to become half or less.","effect_description":"Whenever this Pokémon takes damage from a move that causes its HP to drop below 50%, its Special Attack rises by one stage.","short_effect_description":"Raises this Pokémon's Special Attack by one stage every time its HP drops below half.","pokemon":["drampa","moltres-galar"]},"slush-rush":{"name":"slush-rush","description":"Boosts the Pokémon’s Speed stat in a hailstorm.","effect_description":"During Hail, this Pokémon has double Speed.","short_effect_description":"During Hail, this Pokémon has double Speed.","pokemon":["cubchoo","beartic","arctozolt","arctovish","sandshrew-alola","sandslash-alola"]},"long-reach":{"name":"long-reach","description":"The Pokémon uses its moves without making contact with the target.","effect_description":"A move used by this Pokémon will not make contact.","short_effect_description":"This Pokémon's moves do not make contact.","pokemon":["rowlet","dartrix","decidueye"]},"liquid-voice":{"name":"liquid-voice","description":"All sound-based moves become Water-type moves.","effect_description":"When this Pokémon uses a move that is sound-based, that move's type is Water.","short_effect_description":"Sound-based moves become Water-type.","pokemon":["popplio","brionne","primarina"]},"triage":{"name":"triage","description":"Gives priority to a healing move.","effect_description":"This Pokémon's healing moves have their priority increased by 3.","short_effect_description":"This Pokémon's healing moves have their priority increased by 3.","pokemon":["comfey"]},"galvanize":{"name":"galvanize","description":"Normal-type moves become Electric-type moves. The power of those moves is boosted a little.","effect_description":"When this Pokémon uses a Normal moves, that move is Electric its power is 1.2×.","short_effect_description":"This Pokémon's Normal moves are Electric and have their power increased to 1.2×.","pokemon":["geodude-alola","graveler-alola","golem-alola"]},"surge-surfer":{"name":"surge-surfer","description":"Doubles the Pokémon’s Speed stat on Electric Terrain.","effect_description":"Doubles this Pokémon's Speed on Electric Terrain.","short_effect_description":"Doubles this Pokémon's Speed on Electric Terrain.","pokemon":["raichu-alola"]},"schooling":{"name":"schooling","description":"When it has a lot of HP, the Pokémon forms a powerful school. It stops schooling when its HP is low.","effect_description":"If this Pokémon is a wishiwashi and level 20 or above, then when it enters battle and at the start of each turn, it becomes Schooling Form if its HP is 25% or higher and Solo Form otherwise.  This ability cannot be replaced, copied, or nullified.","short_effect_description":"Wishiwashi becomes Schooling Form when its HP is 25% or higher.","pokemon":["wishiwashi-solo","wishiwashi-school"]},"disguise":{"name":"disguise","description":"Once per battle, the shroud that covers the Pokémon can protect it from an attack.","effect_description":"If this Pokémon is in its Disguised Form and takes damage from a move, it switches to its Busted Form and the damage is prevented.  Other effects are not prevented.  This ability cannot be copied or replaced.  This ability only takes effect for Mimikyu.","short_effect_description":"Prevents the first instance of battle damage.","pokemon":["mimikyu-disguised","mimikyu-busted","mimikyu-totem-disguised","mimikyu-totem-busted"]},"battle-bond":{"name":"battle-bond","description":"Defeating an opposing Pokémon strengthens the Pokémon’s bond with its Trainer, and it becomes Ash-Greninja. Water Shuriken gets more powerful.","effect_description":"Transforms this Pokémon into Ash-Greninja after fainting an opponent.  Water Shuriken's power is 20 and always hits three times.  This ability cannot be copied or replaced.  This ability only takes effect for Greninja.","short_effect_description":"Transforms this Pokémon into Ash-Greninja after fainting an opponent.  Water Shuriken's power is 20 and always hits three times.","pokemon":["greninja-battle-bond","greninja-ash"]},"power-construct":{"name":"power-construct","description":"Other Cells gather to aid when its HP becomes half or less. Then the Pokémon changes its form to Complete Forme.","effect_description":"Transforms 10% or 50% Zygarde into Complete Forme when its HP is below 50%.  This ability cannot be copied or replaced.  This ability only takes effect for Zygarde.","short_effect_description":"Transforms 10% or 50% Zygarde into Complete Forme when its HP is below 50%.","pokemon":["zygarde-10","zygarde-50","zygarde-complete"]},"corrosion":{"name":"corrosion","description":"The Pokémon can poison the target even if it’s a Steel or Poison type.","effect_description":"This Pokémon's moves and item ignore the usual immunity of Poison and Steel Pokémon when attempting to inflict poison.","short_effect_description":"This Pokémon can inflict poison on Poison and Steel Pokémon.","pokemon":["salandit","salazzle","salazzle-totem"]},"comatose":{"name":"comatose","description":"It’s always drowsing and will never wake up. It can attack without waking up.","effect_description":"This Pokémon always acts as though it were Asleep.  It cannot be given another status ailment; it's unaffected by yawn; it can use sleep talk; and so on.","short_effect_description":"This Pokémon always  acts as though it were Asleep.","pokemon":["komala"]},"queenly-majesty":{"name":"queenly-majesty","description":"Its majesty pressures the opposing Pokémon, making it unable to attack using priority moves.","effect_description":"When an opposing Pokémon attempts to use a move that targets this Pokémon or an ally, and that move has priority, it will fail.","short_effect_description":"Opposing Pokémon cannot use priority attacks.","pokemon":["tsareena"]},"innards-out":{"name":"innards-out","description":"Damages the attacker landing the finishing hit by the amount equal to its last HP.","effect_description":"When this Pokémon faints from an opponent's move, that opponent takes damage equal to the HP this Pokémon had remaining.","short_effect_description":"When this Pokémon faints from an opponent's move, that opponent takes damage equal to the HP this Pokémon had remaining.","pokemon":["pyukumuku"]},"dancer":{"name":"dancer","description":"When another Pokémon uses a dance move, it can use a dance move following it regardless of its Speed.","effect_description":"Whenever another Pokémon uses a dance move, this Pokémon will use the same move immediately afterwards.","short_effect_description":"Whenever another Pokémon uses a dance move, this Pokémon will use the same move immediately afterwards.","pokemon":["oricorio-baile","oricorio-pom-pom","oricorio-pau","oricorio-sensu"]},"battery":{"name":"battery","description":"Powers up ally Pokémon’s special moves.","effect_description":"Ally Pokémon's moves have their power increased to 1.3×.","short_effect_description":"Ally Pokémon's moves have their power increased to 1.3×.","pokemon":["charjabug"]},"fluffy":{"name":"fluffy","description":"Halves the damage taken from moves that make direct contact, but doubles that of Fire-type moves.","effect_description":"Damage from contact moves is halved.  Damage from Fire moves is doubled.","short_effect_description":"Damage from contact moves is halved.  Damage from Fire moves is doubled.","pokemon":["stufful","bewear","wooloo","dubwool"]},"dazzling":{"name":"dazzling","description":"Surprises the opposing Pokémon, making it unable to attack using priority moves.","effect_description":"When an opposing Pokémon attempts to use a move that targets this Pokémon or an ally, and that move has priority, it will fail.","short_effect_description":"Opposing Pokémon cannot use priority attacks.","pokemon":["bruxish"]},"soul-heart":{"name":"soul-heart","description":"Boosts its Sp. Atk stat every time a Pokémon faints.","effect_description":"This Pokémon's Special Attack rises by one stage every time any Pokémon faints.","short_effect_description":"This Pokémon's Special Attack rises by one stage every time any Pokémon faints.","pokemon":["magearna","magearna-original"]},"tangling-hair":{"name":"tangling-hair","description":"Contact with the Pokémon lowers the attacker’s Speed stat.","effect_description":"When this Pokémon takes regular damage from a contact move, the attacking Pokémon's Speed lowers by one stage.","short_effect_description":"When this Pokémon takes regular damage from a contact move, the attacking Pokémon's Speed lowers by one stage.","pokemon":["diglett-alola","dugtrio-alola"]},"receiver":{"name":"receiver","description":"The Pokémon copies the Ability of a defeated ally.","effect_description":"When an ally faints, this Pokémon gains its Ability.","short_effect_description":"When an ally faints, this Pokémon gains its Ability.","pokemon":["passimian"]},"power-of-alchemy":{"name":"power-of-alchemy","description":"The Pokémon copies the Ability of a defeated ally.","effect_description":"When an ally faints, this Pokémon gains its Ability.","short_effect_description":"When an ally faints, this Pokémon gains its Ability.","pokemon":["grimer-alola","muk-alola"]},"beast-boost":{"name":"beast-boost","description":"The Pokémon boosts its most proficient stat each time it knocks out a Pokémon.","effect_description":"Raises this Pokémon's highest stat by one stage when it faints another Pokémon.","short_effect_description":"Raises this Pokémon's highest stat by one stage when it faints another Pokémon.","pokemon":["nihilego","buzzwole","pheromosa","xurkitree","celesteela","kartana","guzzlord","poipole","naganadel","stakataka","blacephalon"]},"rks-system":{"name":"rks-system","description":"Changes the Pokémon’s type to match the memory disc it holds.","effect_description":"Changes this Pokémon's type to match its held Memory.  This ability cannot be copied, replaced, or nullified.  This ability only takes effect for Silvally.","short_effect_description":"Changes this Pokémon's type to match its held Memory.","pokemon":["silvally"]},"electric-surge":{"name":"electric-surge","description":"Turns the ground into Electric Terrain when the Pokémon enters a battle.","effect_description":"When this Pokémon enters battle, it changes the terrain to electric terrain.","short_effect_description":"When this Pokémon enters battle, it changes the terrain to Electric Terrain.","pokemon":["tapu-koko","pincurchin"]},"psychic-surge":{"name":"psychic-surge","description":"Turns the ground into Psychic Terrain when the Pokémon enters a battle.","effect_description":"When this Pokémon enters battle, it changes the terrain to psychic terrain.","short_effect_description":"When this Pokémon enters battle, it changes the terrain to Psychic Terrain.","pokemon":["tapu-lele","indeedee-male","indeedee-female"]},"misty-surge":{"name":"misty-surge","description":"Turns the ground into Misty Terrain when the Pokémon enters a battle.","effect_description":"When this Pokémon enters battle, it changes the terrain to misty terrain.","short_effect_description":"When this Pokémon enters battle, it changes the terrain to Misty Terrain.","pokemon":["tapu-fini","weezing-galar"]},"grassy-surge":{"name":"grassy-surge","description":"Turns the ground into Grassy Terrain when the Pokémon enters a battle.","effect_description":"When this Pokémon enters battle, it changes the terrain to grassy terrain.","short_effect_description":"When this Pokémon enters battle, it changes the terrain to Grassy Terrain.","pokemon":["tapu-bulu","grookey","thwackey","rillaboom","rillaboom-gmax"]},"full-metal-body":{"name":"full-metal-body","description":"Prevents other Pokémon’s moves or Abilities from lowering the Pokémon’s stats.","effect_description":"This Pokémon's stats cannot be lowered by other Pokémon's moves or abilities.  This effect only applies to normal stat modifications and not more exotic effects such as topsy turvy or power swap.  This Ability is not bypassed by mold breaker, teravolt, or turboblaze.","short_effect_description":"Other Pokémon cannot lower this Pokémon's stats.","pokemon":["solgaleo"]},"shadow-shield":{"name":"shadow-shield","description":"Reduces the amount of damage the Pokémon takes while its HP is full.","effect_description":"When this Pokémon has full HP, regular damage (not fixed damage!) from moves is halved.  This ability cannot be nullified.","short_effect_description":"When this Pokémon has full HP, regular damage from moves is halved.","pokemon":["lunala"]},"prism-armor":{"name":"prism-armor","description":"Reduces the power of supereffective attacks taken.","effect_description":"Super-effective damage this Pokémon takes is reduced to 0.75×.  This Ability is not bypassed by mold breaker, teravolt, or turboblaze.","short_effect_description":"Reduces super-effective damage to 0.75×.","pokemon":["necrozma","necrozma-dusk","necrozma-dawn"]},"neuroforce":{"name":"neuroforce","description":"Powers up moves that are super effective.","effect_description":"Increases super-effective damage dealt to 1.25×.","short_effect_description":"Increases super-effective damage dealt to 1.25×.","pokemon":["necrozma-ultra"]},"intrepid-sword":{"name":"intrepid-sword","description":"Boosts the Pokémon's Attack stat when the Pokémon enters a battle.","effect_description":null,"short_effect_description":null,"pokemon":["zacian-hero","zacian-crowned"]},"dauntless-shield":{"name":"dauntless-shield","description":"Boosts the Pokémon's Defense stat when the Pokémon enters a battle.","effect_description":null,"short_effect_description":null,"pokemon":["zamazenta-hero","zamazenta-crowned"]},"libero":{"name":"libero","description":"Changes the Pokémon's type to the type of the move it's about to use.","effect_description":null,"short_effect_description":null,"pokemon":["scorbunny","raboot","cinderace","cinderace-gmax"]},"ball-fetch":{"name":"ball-fetch","description":"If the Pokémon is not holding an item, it will fetch the Poké Ball from the first failed throw of the battle.","effect_description":null,"short_effect_description":null,"pokemon":["yamper"]},"cotton-down":{"name":"cotton-down","description":"When the Pokémon is hit by an attack, it scatters cotton fluff around and lowers the Speed stat of all Pokémon except itself.","effect_description":null,"short_effect_description":null,"pokemon":["gossifleur","eldegoss"]},"propeller-tail":{"name":"propeller-tail","description":"Ignores the effects of opposing Pokémon's Abilities and moves that draw in moves.","effect_description":null,"short_effect_description":null,"pokemon":["arrokuda","barraskewda"]},"mirror-armor":{"name":"mirror-armor","description":"Bounces back only the stat-lowering effects that the Pokémon receives.","effect_description":null,"short_effect_description":null,"pokemon":["corviknight","corviknight-gmax"]},"gulp-missile":{"name":"gulp-missile","description":"When the Pokémon uses Surf or Dive, it will come back with prey. When it takes damage, it will spit out the prey to attack.","effect_description":null,"short_effect_description":null,"pokemon":["cramorant"]},"stalwart":{"name":"stalwart","description":"Ignores the effects of opposing Pokémon's Abilities and moves that draw in moves.","effect_description":null,"short_effect_description":null,"pokemon":["duraludon","duraludon-gmax"]},"steam-engine":{"name":"steam-engine","description":"Boosts the Pokémon's Speed stat drastically if hit by a Fire- or Water-type move.","effect_description":null,"short_effect_description":null,"pokemon":["rolycoly","carkol","coalossal","coalossal-gmax"]},"punk-rock":{"name":"punk-rock","description":"Boosts the power of sound-based moves. The Pokémon also takes half the damage from these kinds of moves.","effect_description":null,"short_effect_description":null,"pokemon":["toxtricity-amped","toxtricity-low-key","toxtricity-amped-gmax","toxtricity-low-key-gmax"]},"sand-spit":{"name":"sand-spit","description":"The Pokémon creates a sandstorm when it's hit by an attack.","effect_description":null,"short_effect_description":null,"pokemon":["silicobra","sandaconda","sandaconda-gmax"]},"ice-scales":{"name":"ice-scales","description":"The Pokémon is protected by ice scales, which halve the damage taken from special moves.","effect_description":null,"short_effect_description":null,"pokemon":["snom","frosmoth"]},"ripen":{"name":"ripen","description":"Ripens Berries and doubles their effect.","effect_description":null,"short_effect_description":null,"pokemon":["applin","flapple","appletun","flapple-gmax","appletun-gmax"]},"ice-face":{"name":"ice-face","description":"The Pokémon's ice head can take a physical attack as a substitute, but the attack also changes the Pokémon's appearance. The ice will be restored when it hails.","effect_description":null,"short_effect_description":null,"pokemon":["eiscue-ice","eiscue-noice"]},"power-spot":{"name":"power-spot","description":"Just being next to the Pokémon powers up moves.","effect_description":null,"short_effect_description":null,"pokemon":["stonjourner"]},"mimicry":{"name":"mimicry","description":"Changes the Pokémon's type depending on the terrain.","effect_description":null,"short_effect_description":null,"pokemon":["stunfisk-galar"]},"screen-cleaner":{"name":"screen-cleaner","description":"When the Pokémon enters a battle, the effects of Light Screen, Reflect, and Aurora Veil are nullified for both opposing and ally Pokémon.","effect_description":null,"short_effect_description":null,"pokemon":["mr-rime","mr-mime-galar"]},"steely-spirit":{"name":"steely-spirit","description":"Powers up ally Pokémon's Steel-type moves.","effect_description":null,"short_effect_description":null,"pokemon":["perrserker"]},"perish-body":{"name":"perish-body","description":"When hit by a move that makes direct contact, the Pokémon and the attacker will faint after three turns unless they switch out of battle.","effect_description":null,"short_effect_description":null,"pokemon":["cursola"]},"wandering-spirit":{"name":"wandering-spirit","description":"The Pokémon exchanges Abilities with a Pokémon that hits it with a move that makes direct contact.","effect_description":null,"short_effect_description":null,"pokemon":["runerigus","yamask-galar"]},"gorilla-tactics":{"name":"gorilla-tactics","description":"Boosts the Pokémon's Attack stat but only allows the use of the first selected move.","effect_description":null,"short_effect_description":null,"pokemon":["darmanitan-standard-galar","darmanitan-zen-galar"]},"neutralizing-gas":{"name":"neutralizing-gas","description":"If the Pokémon with Neutralizing Gas is in the battle, the effects of all Pokémon's Abilities will be nullified or will not be triggered.","effect_description":null,"short_effect_description":null,"pokemon":["weezing-galar"]},"pastel-veil":{"name":"pastel-veil","description":"Protects the Pokémon and its ally Pokémon from being poisoned.","effect_description":null,"short_effect_description":null,"pokemon":["ponyta-galar","rapidash-galar"]},"hunger-switch":{"name":"hunger-switch","description":"The Pokémon changes its form, alternating between its Full Belly Mode and Hangry Mode after the end of each turn.","effect_description":null,"short_effect_description":null,"pokemon":["morpeko"]},"quick-draw":{"name":"quick-draw","description":"Enables the Pokémon to move first occasionally.","effect_description":null,"short_effect_description":null,"pokemon":["slowbro-galar"]},"unseen-fist":{"name":"unseen-fist","description":"If the Pokémon uses moves that make direct contact, it can attack the target even if the target protects itself.","effect_description":null,"short_effect_description":null,"pokemon":["urshifu-single-strike","urshifu-rapid-strike","urshifu-single-strike-gmax","urshifu-rapid-strike-gmax"]},"curious-medicine":{"name":"curious-medicine","description":"When the Pokémon enters a battle, it scatters medicine from its shell, which removes all stat changes from allies.","effect_description":null,"short_effect_description":null,"pokemon":["slowking-galar"]},"transistor":{"name":"transistor","description":"Powers up Electric-type moves.","effect_description":null,"short_effect_description":null,"pokemon":["regieleki"]},"dragons-maw":{"name":"dragons-maw","description":"Powers up Dragon-type moves.","effect_description":null,"short_effect_description":null,"pokemon":["regidrago"]},"chilling-neigh":{"name":"chilling-neigh","description":"When the Pokémon knocks out a target, it utters a chilling neigh, which boosts its Attack stat.","effect_description":null,"short_effect_description":null,"pokemon":["glastrier"]},"grim-neigh":{"name":"grim-neigh","description":"When the Pokémon knocks out a target, it utters a terrifying neigh, which boosts its Sp. Atk stat.","effect_description":null,"short_effect_description":null,"pokemon":["spectrier"]},"as-one":{"name":"as-one","description":"This Ability combines the effects of both Calyrex's Unnerve Ability and Spectrier's Grim Neigh Ability.","effect_description":null,"short_effect_description":null,"pokemon":["calyrex-shadow-rider"]},"mountaineer":{"name":"mountaineer","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"wave-rider":{"name":"wave-rider","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"skater":{"name":"skater","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"thrust":{"name":"thrust","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"perception":{"name":"perception","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"parry":{"name":"parry","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"instinct":{"name":"instinct","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"dodge":{"name":"dodge","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"jagged-edge":{"name":"jagged-edge","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"frostbite":{"name":"frostbite","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"tenacity":{"name":"tenacity","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"pride":{"name":"pride","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"deep-sleep":{"name":"deep-sleep","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"power-nap":{"name":"power-nap","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"spirit":{"name":"spirit","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"warm-blanket":{"name":"warm-blanket","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"gulp":{"name":"gulp","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"herbivore":{"name":"herbivore","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"sandpit":{"name":"sandpit","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"hot-blooded":{"name":"hot-blooded","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"medic":{"name":"medic","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"life-force":{"name":"life-force","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"lunchbox":{"name":"lunchbox","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"nurse":{"name":"nurse","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"melee":{"name":"melee","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"sponge":{"name":"sponge","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"bodyguard":{"name":"bodyguard","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"hero":{"name":"hero","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"last-bastion":{"name":"last-bastion","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"stealth":{"name":"stealth","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"vanguard":{"name":"vanguard","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"nomad":{"name":"nomad","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"sequence":{"name":"sequence","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"grass-cloak":{"name":"grass-cloak","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"celebrate":{"name":"celebrate","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"lullaby":{"name":"lullaby","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"calming":{"name":"calming","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"daze":{"name":"daze","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"frighten":{"name":"frighten","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"interference":{"name":"interference","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"mood-maker":{"name":"mood-maker","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"confidence":{"name":"confidence","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"fortune":{"name":"fortune","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"bonanza":{"name":"bonanza","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"explode":{"name":"explode","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"omnipotent":{"name":"omnipotent","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"share":{"name":"share","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"black-hole":{"name":"black-hole","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"shadow-dash":{"name":"shadow-dash","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"sprint":{"name":"sprint","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"disgust":{"name":"disgust","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"high-rise":{"name":"high-rise","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"climber":{"name":"climber","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"flame-boost":{"name":"flame-boost","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"aqua-boost":{"name":"aqua-boost","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"run-up":{"name":"run-up","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"conqueror":{"name":"conqueror","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"shackle":{"name":"shackle","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"decoy":{"name":"decoy","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]},"shield":{"name":"shield","description":null,"effect_description":null,"short_effect_description":null,"pokemon":[]}}